export default {
  "causative_negative": {
    "rules": "けり|1れません,り|らせない,ごし|1さなかったら,し|さない,ね|1させない,ぜ|1させない,に|ななかったら,来|1させない,べ|1させない,じ|1させない,ち|たせない,て|1させない,せ|1させない,げ|1させない,ぎ|がない,び|ばない,め|1させない,け|1させない,え|1させない,み|ませない,い|わせない,き|かせない,れ|1させない",
    "exceptions": "足り|2させない,書き|1かなかったら,働き|1かなかったら,着|1なかったら,洗い|1わなかったら,歩き|1かなかったら,待ち|1たなかったら,考え|2なかったら,思い|1わなかったら,泊まり|2らなかったら,立ち|1たなかったら,話し|1さなかったら,寝|1なかったら,言い|1わなかったら,走り|1らなかったら,返り|1らなかったら,似|1させない,読み|1まなかったら,覚え|2なかったら,引き|1かなかったら,遊び|1ばなかったら,過ぎ|2させない,開け|2なかったら,要り|1らなかったら,会い|1わなかったら,見|1なかったら,聞き|1かなかったら,貸し|1さなかったら,知り|1らなかったら,急ぎ|1がなかったら,出|1なかったら,行き|1かなかったら,起き|2させない,降り|2させない,得|1させない,落ち|2させない,入り|1らなかったら,食べ|2なかったら,飲み|1まなかったら,切り|1らなかったら,喋り|1らなかったら,買い|1わなかったら,沸き|1かなかったら,借り|2させない,始め|2なかったら,生き|2させない,浴び|2させない",
    "rev": "けれません|1り,ばなかったら|び,けなかったら|1,がなかったら|ぎ,べなかったら|1,ななかったら|に,めなかったら|1,たなかったら|ち,えなかったら|1,まなかったら|み,さなかったら|し,わなかったら|い,かなかったら|き,らなかったら|り,たせない|ち,がない|ぎ,ばない|び,ませない|み,わせない|い,かせない|き,さない|し,らせない|り,させない|"
  },
  "causative": {
    "rules": "けり|1れます,り|らせる,ごし|2たら,し|させる,ね|1させる,ぜ|1させる,に|んだら,来|1させる,べ|1させる,じ|1させる,ち|たせる,て|1させる,せ|1させる,げ|1させる,ぎ|がせる,び|ばせる,め|1させる,け|1させる,え|1させる,み|ませる,い|わせる,き|かせる,れ|1させる",
    "exceptions": "足り|2させる,書き|1いたら,働き|1いたら,着|1たら,洗い|1ったら,歩き|1いたら,待ち|1ったら,考え|2たら,思い|1ったら,泊まり|2ったら,立ち|1ったら,話し|2たら,寝|1たら,言い|1ったら,走り|1ったら,返り|1ったら,似|1させる,読み|1んだら,覚え|2たら,引き|1いたら,遊び|1んだら,過ぎ|2させる,開け|2たら,要り|1ったら,会い|1ったら,見|1たら,聞き|1いたら,貸し|2たら,知り|1ったら,急ぎ|1いだら,出|1たら,行き|1ったら,起き|2させる,降り|2させる,得|1させる,落ち|2させる,入り|1ったら,食べ|2たら,飲み|1んだら,切り|1ったら,喋り|1ったら,買い|1ったら,沸き|1いたら,借り|2させる,始め|2たら,生き|2させる,浴び|2させる,消し|1させる,騙し|1させる,試し|1させる,現し|1させる,離し|1させる,探し|1させる,戻し|1させる,外し|1させる,直し|1させる,押し|1させる,刺し|1させる,倒し|1させる,熟し|1させる,污し|1させる,残し|1させる,殺し|1させる,示し|1させる,隠し|1させる,渡し|1させる,干し|1させる,死に|1んだら,崩し|1させる,越し|1させる,壊し|1させる,志し|1させる,足し|1させる",
    "rev": "けれます|1り,こさせる|1し,たさせる|1し,逃させる|1し,とさせる|1し,くさせる|1し,做させる|1し,まさせる|1し,ろさせる|1し,ぼさせる|1し,い表させる|2し,ばさせる|1し,出させる|1し,返させる|1し,やさせる|1し,たせる|ち,かさせる|1し,らさせる|1し,がせる|ぎ,ばせる|び,ませる|み,わせる|い,かせる|き,らせる|り,させる|,まったら|1り,けたら|1,いだら|ぎ,べたら|1,めたら|1,えたら|1,したら|1,いたら|き"
  },
  "conditional_negative": {
    "rules": "ね|1なかったら,ぜ|1なかったら,来|1なかったら,べ|1なかったら,じ|1なかったら,ち|たなかったら,て|1なかったら,せ|1なかったら,げ|1なかったら,ぎ|がなかったら,び|ばなかったら,め|1なかったら,け|1なかったら,え|1なかったら,み|まなかったら,い|わなかったら,き|かなかったら,れ|1なかったら,し|さなかったら,り|らなかったら",
    "exceptions": "足り|2なかったら,似|1なかったら,過ぎ|2なかったら,起き|2なかったら,降り|2なかったら,得|1なかったら,落ち|2なかったら,借り|2なかったら,生き|2なかったら,浴び|2なかったら",
    "rev": "ねなかったら|1,ぎなかったら|1,ぜなかったら|1,ちなかったら|1,来なかったら|1,びなかったら|1,きなかったら|1,りなかったら|1,べなかったら|1,じなかったら|1,たなかったら|ち,てなかったら|1,せなかったら|1,げなかったら|1,がなかったら|ぎ,ばなかったら|び,めなかったら|1,けなかったら|1,えなかったら|1,まなかったら|み,わなかったら|い,かなかったら|き,れなかったら|1,さなかったら|し,らなかったら|り"
  },
  "conditional": {
    "rules": "ね|1たら,ぜ|1たら,来|1たら,べ|1たら,じ|1たら,ち|ったら,て|1たら,せ|1たら,げ|1たら,ぎ|いだら,び|んだら,め|1たら,け|1たら,え|1たら,い|ったら,み|んだら,き|いたら,れ|1たら,し|1たら,り|ったら",
    "exceptions": "足り|2たら,似|1たら,過ぎ|2たら,起き|2たら,降り|2たら,得|1たら,落ち|2たら,借り|2たら,生き|2たら,浴び|2たら,喜び|1んだら,勝ち|1ったら,使い|1ったら,結び|1んだら,適い|1ったら,歌い|1ったら,救い|1ったら,貰い|1ったら,及び|1んだら,庇い|1ったら,拾い|1ったら,払い|1ったら,合い|1ったら,学び|1んだら,習い|1ったら,笑い|1ったら,飛び|1んだら,誘い|1ったら,飼い|1ったら,吸い|1ったら,持ち|1ったら,育ち|1ったら,狂い|1ったら,並び|1んだら,転び|1んだら,向かい|2ったら,選び|1んだら,追い|1ったら,祝い|1ったら,構い|1ったら,運び|1んだら,呼び|1んだら,迷い|1ったら,襲い|1ったら",
    "rev": "遣ったら|1い,伝ったら|1い,立ったら|1ち,違ったら|1い,いだら|ぎ,んだら|み,いたら|き,ったら|り,たら|"
  },
  "imperative_negative": {
    "rules": "ね|1るな,ぜ|1るな,に|ぬな,来|1るな,じ|1るな,べ|1るな,て|1るな,せ|1るな,ち|つな,げ|1るな,ぎ|ぐな,び|ぶな,め|1るな,け|1るな,え|1るな,み|むな,れ|1るな,い|うな,き|くな,し|すな,り|るな",
    "exceptions": "足り|2るな,着|1るな,寝|1るな,似|1るな,過ぎ|2るな,見|1るな,出|1るな,起き|2るな,降り|2るな,得|1るな,落ち|2るな,借り|2るな,生き|2るな,浴び|2るな,罵り|1るな,直り|1るな,脂ぎり|2るな,被り|1るな,触り|1るな,縛り|1るな,練り|1るな,取り|1るな,黙り|1るな,滑り|1るな,座り|1るな,光り|1るな,送り|1るな,叱り|1るな,売り|1るな,走り|1るな,実り|1るな,返り|1るな,戻り|1るな,殴り|1るな,祈り|1るな,守り|1るな,滅びり|2るな,要り|1るな,作り|1るな,臥せり|2るな,限り|1るな,残り|1るな,蹴り|1るな,知り|1るな,隠れり|2るな,握り|1るな,通り|1るな,齧り|1るな,回り|1るな,太り|1るな,曇り|1るな,怒り|1るな,釣り|1るな,散り|1るな,眠り|1るな,入り|1るな,掘り|1るな,飾り|1るな,腐り|1るな,減り|1るな,偽り|1るな,踊り|1るな,切り|1るな,渡り|1るな,参り|1るな,登り|1るな,喋り|1るな,乗り|1るな,捻り|1るな,劣り|1るな,混じり|2るな,困り|1るな,焦り|1るな,侍り|1るな,寄り|1るな",
    "rev": "い換えるな|3り,こるな|1り,ぬな|に,行るな|1り,消るな|1り,なるな|1り,わるな|1り,張るな|1り,かるな|1り,つな|ち,がるな|1り,ぐな|ぎ,ぶな|び,まるな|1り,むな|み,うな|い,くな|き,すな|し,るな|"
  },
  "imperative": {
    "rules": "ね|1ろ,ぜ|1ろ,に|ね,来|1ろ,じ|1ろ,べ|1ろ,て|1ろ,せ|1ろ,ち|て,げ|1ろ,ぎ|げ,び|べ,め|1ろ,け|1ろ,え|1ろ,れ|1ろ,み|め,い|え,き|け,し|せ,り|れ",
    "exceptions": "足り|2ろ,着|1ろ,寝|1ろ,似|1ろ,過ぎ|2ろ,見|1ろ,出|1ろ,呉れ|2,起き|2ろ,降り|2ろ,得|1ろ,落ち|2ろ,借り|2ろ,生き|2ろ,浴び|2ろ",
    "rev": "ね|に,て|ち,げ|ぎ,べ|び,め|み,え|い,け|き,せ|し,れ|り,ろ|"
  },
  "infinitive": {
    "rules": "ね|1,ぜ|1,に|1,来|1,じ|1,べ|1,て|1,せ|1,げ|1,ち|1,ぎ|1,び|1,め|1,け|1,え|1,み|1,れ|1,い|1,き|1,し|1,り|1",
    "exceptions": "着|1,寝|1,似|1,見|1,出|1,得|1",
    "rev": "ね|1,ぜ|1,に|1,来|1,じ|1,べ|1,て|1,せ|1,げ|1,ち|1,ぎ|1,び|1,め|1,け|1,え|1,み|1,れ|1,い|1,き|1,し|1,り|1"
  },
  "passive_negative": {
    "rules": "けり|1らせません,り|られない,ごし|1せない,し|されない,ね|1られない,ぜ|1られない,に|ねない,来|1られない,じ|1られない,ち|たれない,べ|1られない,て|1られない,せ|1られない,げ|1られない,ぎ|がれない,び|ばれない,め|1られない,け|1られない,え|1られない,み|まれない,い|われない,き|かれない,れ|1られない",
    "exceptions": "足り|2られない,書き|1けない,働き|1けない,着|1られない,洗い|1えない,歩き|1けない,待ち|1てない,思い|1えない,泊まり|2れない,立ち|1てない,話し|1せない,寝|1られない,言い|1えない,走り|1れない,返り|1れない,似|1られない,読み|1めない,引き|1けない,遊び|1べない,過ぎ|2られない,要り|1れない,会い|1えない,見|1られない,聞き|1けない,貸し|1せない,知り|1れない,急ぎ|1げない,出|1られない,行き|1けない,起き|2られない,降り|2られない,得|1られない,落ち|2られない,入り|1れない,飲み|1めない,切り|1れない,喋り|1れない,買い|1えない,沸き|1けない,借り|2られない,生き|2られない,浴び|2られない,罵り|1られない,直り|1られない,脂ぎり|2られない,被り|1られない,触り|1られない,縛り|1られない,練り|1られない,取り|1られない,黙り|1られない,滑り|1られない,座り|1られない,光り|1られない,送り|1られない,叱り|1られない,売り|1られない,実り|1られない,戻り|1られない,殴り|1られない,祈り|1られない,守り|1られない,滅びり|2られない,作り|1られない,臥せり|2られない,限り|1られない,残り|1られない,蹴り|1られない,隠れり|2られない,握り|1られない,通り|1られない,齧り|1られない,回り|1られない,太り|1られない,曇り|1られない,怒り|1られない,釣り|1られない,散り|1られない,眠り|1られない,掘り|1られない,飾り|1られない,腐り|1られない,減り|1られない,偽り|1られない,踊り|1られない,渡り|1られない,参り|1られない,登り|1られない,乗り|1られない,捻り|1られない,劣り|1られない,混じり|2られない,困り|1られない,焦り|1られない,侍り|1られない,寄り|1られない",
    "rev": "けらせません|1り,い換えられない|3り,べない|び,こられない|1り,げない|ぎ,ねない|に,行られない|1り,消られない|1り,てない|ち,めない|み,なられない|1り,わられない|1り,せない|し,たれない|ち,張られない|1り,かられない|1り,えない|い,けない|き,がられない|1り,がれない|ぎ,ばれない|び,まられない|1り,まれない|み,われない|い,かれない|き,されない|し,られない|"
  },
  "passive": {
    "rules": "けり|1らせます,り|られる,ごし|1せる,し|される,ね|1られる,ぜ|1られる,に|ねる,来|1られる,じ|1られる,ち|たれる,べ|1られる,て|1られる,せ|1られる,げ|1られる,ぎ|がれる,び|ばれる,め|1られる,け|1られる,え|1られる,み|まれる,い|われる,き|かれる,れ|1られる",
    "exceptions": "足り|2られる,書き|1ける,働き|1ける,着|1られる,洗い|1える,歩き|1ける,待ち|1てる,思い|1える,泊まり|2れる,立ち|1てる,話し|1せる,寝|1られる,言い|1える,走り|1れる,返り|1れる,似|1られる,読み|1める,引き|1ける,遊び|1べる,過ぎ|2られる,要り|1れる,会い|1える,見|1られる,聞き|1ける,貸し|1せる,知り|1れる,急ぎ|1げる,出|1られる,行き|1ける,起き|2られる,降り|2られる,得|1られる,落ち|2られる,入り|1れる,飲み|1める,切り|1れる,喋り|1れる,買い|1える,沸き|1ける,借り|2られる,生き|2られる,浴び|2られる,罵り|1られる,直り|1られる,脂ぎり|2られる,被り|1られる,触り|1られる,縛り|1られる,練り|1られる,取り|1られる,黙り|1られる,滑り|1られる,座り|1られる,光り|1られる,送り|1られる,叱り|1られる,売り|1られる,実り|1られる,戻り|1られる,殴り|1られる,祈り|1られる,守り|1られる,滅びり|2られる,作り|1られる,臥せり|2られる,限り|1られる,残り|1られる,蹴り|1られる,隠れり|2られる,握り|1られる,通り|1られる,齧り|1られる,回り|1られる,太り|1られる,曇り|1られる,怒り|1られる,釣り|1られる,散り|1られる,眠り|1られる,掘り|1られる,飾り|1られる,腐り|1られる,減り|1られる,偽り|1られる,踊り|1られる,渡り|1られる,参り|1られる,登り|1られる,乗り|1られる,捻り|1られる,劣り|1られる,混じり|2られる,困り|1られる,焦り|1られる,侍り|1られる,寄り|1られる",
    "rev": "けらせます|1り,い換えられる|3り,べる|び,こられる|1り,げる|ぎ,ねる|に,行られる|1り,消られる|1り,てる|ち,める|み,なられる|1り,わられる|1り,せる|し,たれる|ち,張られる|1り,かられる|1り,える|い,ける|き,がられる|1り,がれる|ぎ,ばれる|び,まられる|1り,まれる|み,われる|い,かれる|き,される|し,られる|"
  },
  "past_negative": {
    "rules": "けり|1らないでください,り|らなかった,ね|1なかった,ぜ|1なかった,来|1なかった,べ|1なかった,じ|1なかった,ち|たなかった,て|1なかった,せ|1なかった,ぎ|がなかった,げ|1なかった,び|ばなかった,め|1なかった,け|1なかった,え|1なかった,み|まなかった,い|わなかった,き|かなかった,れ|1なかった,し|さなかった",
    "exceptions": "足り|2なかった,似|1なかった,過ぎ|2なかった,起き|2なかった,降り|2なかった,得|1なかった,落ち|2なかった,借り|2なかった,生き|2なかった,浴び|2なかった,ふけり|2らないでください",
    "rev": "ねなかった|1,ぎなかった|1,ぜなかった|1,ちなかった|1,来なかった|1,びなかった|1,きなかった|1,りなかった|1,べなかった|1,じなかった|1,たなかった|ち,てなかった|1,せなかった|1,がなかった|ぎ,げなかった|1,ばなかった|び,めなかった|1,けなかった|1,えなかった|1,まなかった|み,わなかった|い,かなかった|き,れなかった|1,さなかった|し,らなかった|り"
  },
  "past": {
    "rules": "けり|1ってください,り|った,ね|1た,ぜ|1た,来|1た,べ|1た,じ|1た,ち|った,て|1た,せ|1た,ぎ|いだ,げ|1た,び|んだ,め|1た,け|1た,え|1た,み|んだ,い|った,き|いた,れ|1た,し|1た",
    "exceptions": "足り|2た,似|1た,過ぎ|2た,起き|2た,降り|2た,得|1た,落ち|2た,借り|2た,生き|2た,浴び|2た,喜び|1んだ,勝ち|1った,使い|1った,結び|1んだ,適い|1った,歌い|1った,救い|1った,貰い|1った,及び|1んだ,庇い|1った,拾い|1った,払い|1った,合い|1った,学び|1んだ,習い|1った,笑い|1った,飛び|1んだ,誘い|1った,飼い|1った,吸い|1った,持ち|1った,育ち|1った,狂い|1った,並び|1んだ,転び|1んだ,向かい|2った,選び|1んだ,追い|1った,祝い|1った,構い|1った,運び|1んだ,呼び|1んだ,迷い|1った,襲い|1った",
    "rev": "けってください|1り,遣った|1い,立った|1ち,違った|1い,いた|き,った|り,た|,いだ|ぎ,んだ|み"
  },
  "past_presumptive_negative": {
    "rules": "ね|1なかっただろう,ぜ|1なかっただろう,来|1なかっただろう,べ|1なかっただろう,じ|1なかっただろう,ち|たなかっただろう,て|1なかっただろう,せ|1なかっただろう,げ|1なかっただろう,ぎ|がなかっただろう,び|ばなかっただろう,め|1なかっただろう,け|1なかっただろう,え|1なかっただろう,み|まなかっただろう,い|わなかっただろう,き|かなかっただろう,れ|1なかっただろう,し|さなかっただろう,り|らなかっただろう",
    "exceptions": "足り|2なかっただろう,似|1なかっただろう,過ぎ|2なかっただろう,起き|2なかっただろう,降り|2なかっただろう,得|1なかっただろう,落ち|2なかっただろう,借り|2なかっただろう,生き|2なかっただろう,浴び|2なかっただろう,喜び|1ばなかっただろう,見つかり|3らなかっただろう,違い|1わなかっただろう,抜け|2なかっただろう,異なり|2らなかっただろう,罵り|1らなかっただろう,生まれ|3なかっただろう,負け|2なかっただろう,直り|1らなかっただろう,焦げ|2なかっただろう,決まり|2らなかっただろう,折れ|2なかっただろう,脂ぎり|2らなかっただろう,包み|1まなかっただろう,傷つけ|3なかっただろう,気遣い|2わなかっただろう,枯れ|2なかっただろう,勝ち|1たなかっただろう,被り|1らなかっただろう,勤め|2なかっただろう,欲しがり|3らなかっただろう,眺め|2なかっただろう,消え|2なかっただろう,解き|1かなかっただろう,起こし|2さなかっただろう,組み|1まなかっただろう,分かり|2らなかっただろう,使い|1わなかっただろう,曲がり|2らなかっただろう,点け|2なかっただろう,消し|1さなかっただろう,騙し|1さなかっただろう,乗り換え|4なかっただろう,触り|1らなかっただろう,触れ|2なかっただろう,虐め|2なかっただろう,育て|2なかっただろう,縛り|1らなかっただろう,結び|1ばなかっただろう,投げ|2なかっただろう,捨て|2なかっただろう,試し|1さなかっただろう,思いつき|3かなかっただろう,練り|1らなかっただろう,戒め|2なかっただろう,冷やかし|3さなかっただろう,言い換えり|4らなかっただろう,取り|1らなかっただろう,関わり|2らなかっただろう,脱ぎ|1がなかっただろう,引き受け|4なかっただろう,掛かり|2らなかっただろう,教え|2なかっただろう,囲み|1まなかっただろう,泳ぎ|1がなかっただろう,支え|2なかっただろう,適い|1わなかっただろう,言い出し|3さなかっただろう,苦しみ|2まなかっただろう,励み|1まなかっただろう,強め|2なかっただろう,黙り|1らなかっただろう,止まり|2らなかっただろう,固め|2なかっただろう,張り|1らなかっただろう,盗み|1まなかっただろう,踏み|1まなかっただろう,広め|2なかっただろう,頑張り|2らなかっただろう,構え|2なかっただろう,広まり|2らなかっただろう,見張り|2らなかっただろう,言いふらし|4さなかっただろう,敷き|1かなかっただろう,滑り|1らなかっただろう,座り|1らなかっただろう,閉め|2なかっただろう,現し|1さなかっただろう,歌い|1わなかっただろう,腰掛け|3なかっただろう,輝き|1かなかっただろう,光り|1らなかっただろう,見せ|2なかっただろう,離し|1さなかっただろう,離れ|2なかっただろう,探し|1さなかっただろう,気付き|2かなかっただろう,送り|1らなかっただろう,叱り|1らなかっただろう,売り|1らなかっただろう,満たし|2さなかっただろう,逃げ|2なかっただろう,実り|1らなかっただろう,蓄え|2なかっただろう,抑え|2なかっただろう,戻り|1らなかっただろう,休み|1まなかっただろう,救い|1わなかっただろう,戻し|1さなかっただろう,繰り返し|3さなかっただろう,外し|1さなかっただろう,求め|2なかっただろう,頼み|1まなかっただろう,直し|1さなかっただろう,惜しみ|2まなかっただろう,減らし|2さなかっただろう,貰い|1わなかっただろう,及び|1ばなかっただろう,届き|1かなかっただろう,掲げ|2なかっただろう,置き|1かなかっただろう,押し|1さなかっただろう,殴り|1らなかっただろう,入れ|2なかっただろう,庇い|1わなかっただろう,履き|1かなかっただろう,儲け|2なかっただろう,祈り|1らなかっただろう,守り|1らなかっただろう,褒め|2なかっただろう,磨き|1かなかっただろう,刺し|1さなかっただろう,企み|1まなかっただろう,企て|2なかっただろう,重ね|2なかっただろう,拾い|1わなかっただろう,弾き|1かなかっただろう,口説き|2かなかっただろう,払い|1わなかっただろう,別れ|2なかっただろう,慌て|2なかっただろう,倒し|1さなかっただろう,滅びり|2らなかっただろう,見逃し|2さなかっただろう,知らせ|3なかっただろう,起こり|2らなかっただろう,動き|1かなかっただろう,溶かし|2さなかっただろう,混ぜ|2なかっただろう,溶け|2なかっただろう,合い|1わなかっただろう,熟し|1さなかっただろう,污し|1さなかっただろう,作り|1らなかっただろう,稼ぎ|1がなかっただろう,騒ぎ|1がなかっただろう,間違え|3なかっただろう,拵え|2なかっただろう,可愛がり|3らなかっただろう,落とし|2さなかっただろう,無くし|2さなかっただろう,見做し|2さなかっただろう,住み|1まなかっただろう,暮らし|2さなかっただろう,下げ|2なかっただろう,臥せり|2らなかっただろう,限り|1らなかっただろう,舐め|2なかっただろう,好み|1まなかっただろう,寄せ|2なかっただろう,並べ|2なかっただろう,残り|1らなかっただろう,残し|1さなかっただろう,枯らし|2さなかっただろう,学び|1ばなかっただろう,習い|1わなかっただろう,傾き|1かなかっただろう,漏れ|2なかっただろう,漏らし|2さなかっただろう,連れ|2なかっただろう,笑い|1わなかっただろう,伏せ|2なかっただろう,殺し|1さなかっただろう,蹴り|1らなかっただろう,飛び|1ばなかっただろう,誘い|1わなかっただろう,飼い|1わなかっただろう,吸い|1わなかっただろう,招き|1かなかっただろう,増え|2なかっただろう,増やし|2さなかっただろう,示し|1さなかっただろう,苦しませ|4なかっただろう,抱え|2なかっただろう,仄めかし|3さなかっただろう,妨げ|2なかっただろう,隠れり|2らなかっただろう,隠し|1さなかっただろう,手伝い|2わなかっただろう,助け|2なかっただろう,掛け|2なかっただろう,渡し|1さなかっただろう,持ち|1たなかっただろう,静まり|2らなかっただろう,生やし|2さなかっただろう,暮れ|2なかっただろう,育ち|1たなかっただろう,生え|2なかっただろう,迎え|2なかっただろう,握り|1らなかっただろう,上がり|2らなかっただろう,通り|1らなかっただろう,出かけ|3なかっただろう,狂い|1わなかっただろう,進み|1まなかっただろう,齧り|1らなかっただろう,睨み|1まなかっただろう,呉れ|2なかっただろう,回り|1らなかっただろう,返し|1さなかっただろう,慣れ|2なかっただろう,馴染み|2まなかっただろう,疲れ|2なかっただろう,暖まり|2らなかっただろう,太り|1らなかっただろう,着換え|3なかっただろう,曇り|1らなかっただろう,怒り|1らなかっただろう,仰ぎ|1がなかっただろう,集め|2なかっただろう,並び|1ばなかっただろう,壊れ|2なかっただろう,忘れ|2なかっただろう,集まり|2らなかっただろう,畳み|1まなかっただろう,釣り|1らなかっただろう,片付け|3なかっただろう,見つけ|3なかっただろう,流れ|2なかっただろう,感じ|2なかっただろう,怖がり|2らなかっただろう,散り|1らなかっただろう,沈み|1まなかっただろう,恐れ|2なかっただろう,倒れ|2なかっただろう,下がり|2らなかっただろう,転び|1ばなかっただろう,惚れ|2なかっただろう,眠り|1らなかっただろう,出し|1さなかっただろう,向かい|2わなかっただろう,抜き|1かなかっただろう,取り換え|4なかっただろう,優れ|2なかっただろう,長け|2なかっただろう,楽しみ|2まなかっただろう,励まし|2さなかっただろう,抱き|1かなかっただろう,終わり|2らなかっただろう,干し|1さなかっただろう,乾かし|2さなかっただろう,降ろし|2さなかっただろう,嫌がり|2らなかっただろう,掘り|1らなかっただろう,崩し|1さなかっただろう,滅ぼし|2さなかっただろう,言い表し|3さなかっただろう,届け|2なかっただろう,喜ばし|2さなかっただろう,負かし|2さなかっただろう,決め|2なかっただろう,飾り|1らなかっただろう,定め|2なかっただろう,腐り|1らなかっただろう,減り|1らなかっただろう,偽り|1らなかっただろう,踊り|1らなかっただろう,泣き|1かなかっただろう,砕き|1かなかっただろう,渡り|1らなかっただろう,数え|2なかっただろう,冷やし|2さなかっただろう,越し|1さなかっただろう,比べ|2なかっただろう,続け|2なかっただろう,凝らし|2さなかっただろう,冷え|2なかっただろう,続き|1かなかっただろう,言いつけ|4なかっただろう,通い|1わなかっただろう,参り|1らなかっただろう,慰め|2なかっただろう,解け|2なかっただろう,取れ|2なかっただろう,崩れ|2なかっただろう,閉まり|2らなかっただろう,晴れ|2なかっただろう,登り|1らなかっただろう,選び|1ばなかっただろう,食い違い|3わなかっただろう,調べ|2なかっただろう,追い|1わなかっただろう,変え|2なかっただろう,変わり|2らなかっただろう,祝い|1わなかっただろう,担ぎ|1がなかっただろう,挟み|1まなかっただろう,焼け|2なかっただろう,構い|1わなかっただろう,立て|2なかっただろう,運び|1ばなかっただろう,沸かし|2さなかっただろう,呼び|1ばなかっただろう,壊し|1さなかっただろう,切れ|2なかっただろう,威張り|2らなかっただろう,吹き|1かなかっただろう,乗り|1らなかっただろう,噛み|1まなかっただろう,咲き|1かなかっただろう,捻り|1らなかっただろう,曲げ|2なかっただろう,濡れ|2なかっただろう,始まり|2らなかっただろう,信じ|2なかっただろう,強まり|2らなかっただろう,固まり|2らなかっただろう,流行り|2らなかっただろう,空き|1かなかっただろう,乾き|1かなかっただろう,痛み|1まなかっただろう,汚れ|2なかっただろう,霞み|1まなかっただろう,劣り|1らなかっただろう,見え|2なかっただろう,驚き|1かなかっただろう,込み|1まなかっただろう,売れ|2なかっただろう,助かり|2らなかっただろう,迷い|1わなかっただろう,悲しみ|2まなかっただろう,次ぎ|1がなかっただろう,儲かり|2らなかっただろう,混じり|2らなかっただろう,間違い|2わなかっただろう,無くなり|3らなかっただろう,重なり|2らなかっただろう,怠け|2なかっただろう,遅れ|2なかっただろう,困り|1らなかっただろう,焦り|1らなかっただろう,基づき|2かなかっただろう,聞こえ|3なかっただろう,出来|2なかっただろう,魂消り|2らなかっただろう,眩み|1まなかっただろう,禁じ|2なかっただろう,焼き|1かなかっただろう,目立ち|2たなかっただろう,襲い|1わなかっただろう,侍り|1らなかっただろう,避け|2なかっただろう,志し|1さなかっただろう,寄り|1らなかっただろう,着き|1かなかっただろう,認め|2なかっただろう,答え|2なかっただろう,加え|2なかっただろう,現れ|2なかっただろう,足し|1さなかっただろう",
    "rev": ""
  },
  "past_presumptive": {
    "rules": "ね|1たろう,ぜ|1たろう,来|1たろう,べ|1たろう,じ|1たろう,ち|っただろう,て|1たろう,せ|1たろう,げ|1たろう,ぎ|いだだろう,び|んだだろう,め|1たろう,け|1たろう,え|1たろう,い|っただろう,み|んだだろう,き|いただろう,れ|1たろう,し|1ただろう,り|っただろう",
    "exceptions": "足り|2たろう,似|1たろう,過ぎ|2たろう,起き|2たろう,降り|2たろう,得|1たろう,落ち|2たろう,借り|2たろう,生き|2たろう,浴び|2たろう,喜び|1んだだろう,勝ち|1っただろう,使い|1っただろう,結び|1んだだろう,適い|1っただろう,歌い|1っただろう,救い|1っただろう,貰い|1っただろう,及び|1んだだろう,庇い|1っただろう,拾い|1っただろう,払い|1っただろう,合い|1っただろう,学び|1んだだろう,習い|1っただろう,笑い|1っただろう,飛び|1んだだろう,誘い|1っただろう,飼い|1っただろう,吸い|1っただろう,持ち|1っただろう,育ち|1っただろう,狂い|1っただろう,並び|1んだだろう,転び|1んだだろう,向かい|2っただろう,選び|1んだだろう,追い|1っただろう,祝い|1っただろう,構い|1っただろう,運び|1んだだろう,呼び|1んだだろう,迷い|1っただろう,襲い|1っただろう",
    "rev": "遣っただろう|1い,伝っただろう|1い,立っただろう|1ち,違っただろう|1い,いだだろう|ぎ,んだだろう|み,いただろう|き,しただろう|1,っただろう|り,たろう|"
  },
  "past_progressive": {
    "rules": "けり|1って います,り|って いた,ね|1て いた,ぜ|1て いた,来|1て いた,べ|1て いた,じ|1て いた,ち|って いた,て|1て いた,せ|1て いた,げ|1て いた,ぎ|いで いた,び|んで いた,め|1て いた,け|1て いた,え|1て いた,い|って いた,み|んで いた,き|いて いた,れ|1て いた,し|1て いた",
    "exceptions": "足り|2て いた,似|1て いた,過ぎ|2て いた,起き|2て いた,降り|2て いた,得|1て いた,落ち|2て いた,借り|2て いた,生き|2て いた,浴び|2て いた,喜び|1んで いた,勝ち|1って いた,使い|1って いた,結び|1んで いた,適い|1って いた,歌い|1って いた,救い|1って いた,貰い|1って いた,及び|1んで いた,庇い|1って いた,拾い|1って いた,払い|1って いた,合い|1って いた,学び|1んで いた,習い|1って いた,笑い|1って いた,飛び|1んで いた,誘い|1って いた,飼い|1って いた,吸い|1って いた,持ち|1って いた,育ち|1って いた,狂い|1って いた,並び|1んで いた,転び|1んで いた,向かい|2って いた,選び|1んで いた,追い|1って いた,祝い|1って いた,構い|1って いた,運び|1んで いた,呼び|1んで いた,迷い|1って いた,襲い|1って いた",
    "rev": "けって います|1り,遣って いた|1い,伝って いた|1い,立って いた|1ち,違って いた|1い,いで いた|ぎ,んで いた|み,いて いた|き,って いた|り,て いた|"
  },
  "potential_negative": {
    "rules": "けり|2ませんでしたら,り|れない,ごし|1さなければ,し|せない,ね|1られない,ぜ|1られない,に|ななければ,来|1られない,べ|1られない,じ|1られない,ち|てない,て|1られない,せ|1られない,げ|1られない,ぎ|げない,び|べない,め|1られない,け|1られない,え|1られない,み|めない,い|えない,き|けない,れ|1られない",
    "exceptions": "足り|2られない,書き|1かなければ,働き|1かなければ,着|1なければ,洗い|1わなければ,歩き|1かなければ,待ち|1たなければ,考え|2なければ,思い|1わなければ,泊まり|2らなければ,立ち|1たなければ,話し|1さなければ,寝|1なければ,言い|1わなければ,走り|1らなければ,返り|1らなければ,似|1られない,読み|1まなければ,覚え|2なければ,引き|1かなければ,遊び|1ばなければ,過ぎ|2られない,開け|2なければ,要り|1らなければ,会い|1わなければ,見|1なければ,聞き|1かなければ,貸し|1さなければ,知り|1らなければ,急ぎ|1がなければ,出|1なければ,行き|1かなければ,起き|2られない,降り|2られない,得|1られない,落ち|2られない,入り|1らなければ,食べ|2なければ,飲み|1まなければ,切り|1らなければ,喋り|1らなければ,買い|1わなければ,沸き|1かなければ,借り|2られない,始め|2なければ,生き|2られない,浴び|2られない,罵り|1れない,直り|1れない,被り|1れない,触り|1れない,縛り|1れない,練り|1れない,取り|1れない,黙り|1れない,滑り|1れない,座り|1れない,光り|1れない,送り|1れない,叱り|1れない,売り|1れない,実り|1れない,戻り|1れない,殴り|1れない,祈り|1れない,守り|1れない,作り|1れない,限り|1れない,残り|1れない,蹴り|1れない,握り|1れない,通り|1れない,齧り|1れない,回り|1れない,太り|1れない,曇り|1れない,怒り|1れない,釣り|1れない,散り|1れない,眠り|1れない,掘り|1れない,飾り|1れない,腐り|1れない,減り|1れない,偽り|1れない,踊り|1れない,渡り|1れない,参り|1れない,登り|1れない,乗り|1れない,捻り|1れない,劣り|1れない,困り|1れない,焦り|1れない,侍り|1れない,寄り|1れない",
    "rev": "ませんでしたら|,ぎれない|1り,い換えれない|3り,びれない|1り,これない|1り,せれない|1り,れれない|1り,行れない|1り,じれない|1り,消れない|1り,なれない|1り,われない|1り,てない|ち,張れない|1り,かれない|1り,がれない|1り,げない|ぎ,べない|び,まれない|1り,めない|み,えない|い,けない|き,せない|し,られない|,ばなければ|び,けなければ|1,がなければ|ぎ,べなければ|1,ななければ|に,めなければ|1,たなければ|ち,えなければ|1,まなければ|み,さなければ|し,わなければ|い,かなければ|き,らなければ|り"
  },
  "potential": {
    "rules": "けり|2ましたら,り|れる,ごし|1せば,し|せる,ね|1られる,ぜ|1られる,に|ねば,来|1られる,べ|1られる,じ|1られる,ち|てる,て|1られる,せ|1られる,げ|1られる,ぎ|げる,び|べる,め|1られる,け|1られる,え|1られる,み|める,い|える,き|ける,れ|1られる",
    "exceptions": "足り|2られる,書き|1けば,働き|1けば,着|1れば,洗い|1えば,歩き|1けば,待ち|1てば,考え|2れば,思い|1えば,泊まり|2れば,立ち|1てば,話し|1せば,寝|1れば,言い|1えば,走り|1れば,返り|1れば,似|1られる,読み|1めば,覚え|2れば,引き|1けば,遊び|1べば,過ぎ|2られる,開け|2れば,要り|1れば,会い|1えば,見|1れば,聞き|1けば,貸し|1せば,知り|1れば,急ぎ|1げば,出|1れば,行き|1けば,起き|2られる,降り|2られる,得|1られる,落ち|2られる,入り|1れば,食べ|2れば,飲み|1めば,切り|1れば,喋り|1れば,買い|1えば,沸き|1けば,借り|2られる,始め|2れば,生き|2られる,浴び|2られる,罵り|1れる,直り|1れる,被り|1れる,触り|1れる,縛り|1れる,練り|1れる,取り|1れる,黙り|1れる,滑り|1れる,座り|1れる,光り|1れる,送り|1れる,叱り|1れる,売り|1れる,実り|1れる,戻り|1れる,殴り|1れる,祈り|1れる,守り|1れる,作り|1れる,限り|1れる,残り|1れる,蹴り|1れる,握り|1れる,通り|1れる,齧り|1れる,回り|1れる,太り|1れる,曇り|1れる,怒り|1れる,釣り|1れる,散り|1れる,眠り|1れる,掘り|1れる,飾り|1れる,腐り|1れる,減り|1れる,偽り|1れる,踊り|1れる,渡り|1れる,参り|1れる,登り|1れる,乗り|1れる,捻り|1れる,劣り|1れる,困り|1れる,焦り|1れる,侍り|1れる,寄り|1れる",
    "rev": "けりましたら|2,ぎれる|1り,い換えれる|3り,びれる|1り,これる|1り,せれる|1り,れれる|1り,行れる|1り,じれる|1り,消れる|1り,なれる|1り,われる|1り,てる|ち,張れる|1り,かれる|1り,がれる|1り,げる|ぎ,べる|び,まれる|1り,める|み,える|い,ける|き,せる|し,られる|,まれば|1り,べば|び,げば|ぎ,ねば|に,てば|ち,めば|み,せば|し,えば|い,けば|き,れば|"
  },
  "present_negative": {
    "rules": "ね|1ない,ぜ|1ない,に|なない,来|1ない,じ|1ない,べ|1ない,て|1ない,せ|1ない,ち|たない,げ|1ない,ぎ|がない,び|ばない,め|1ない,け|1ない,え|1ない,み|まない,れ|1ない,い|わない,き|かない,し|さない,り|らない",
    "exceptions": "足り|2ない,着|1ない,寝|1ない,似|1ない,過ぎ|2ない,見|1ない,出|1ない,起き|2ない,降り|2ない,得|1ない,落ち|2ない,借り|2ない,生き|2ない,浴び|2ない",
    "rev": "ねない|1,ぎない|1,ぜない|1,ちない|1,なない|に,来ない|1,びない|1,きない|1,りない|1,じない|1,べない|1,てない|1,せない|1,たない|ち,げない|1,がない|ぎ,ばない|び,めない|1,けない|1,えない|1,まない|み,れない|1,わない|い,かない|き,さない|し,らない|り"
  },
  "present": {
    "rules": "ね|1る,ぜ|1る,に|ぬ,来|1る,じ|1る,べ|1る,て|1る,せ|1る,ち|つ,げ|1る,ぎ|ぐ,び|ぶ,め|1る,け|1る,え|1る,み|む,れ|1る,い|う,き|く,し|す,り|る",
    "exceptions": "足り|2る,着|1る,寝|1る,似|1る,過ぎ|2る,見|1る,出|1る,起き|2る,降り|2る,得|1る,落ち|2る,借り|2る,生き|2る,浴び|2る,罵り|1る,直り|1る,脂ぎり|2る,被り|1る,触り|1る,縛り|1る,練り|1る,取り|1る,黙り|1る,滑り|1る,座り|1る,光り|1る,送り|1る,叱り|1る,売り|1る,走り|1る,実り|1る,返り|1る,戻り|1る,殴り|1る,祈り|1る,守り|1る,滅びり|2る,要り|1る,作り|1る,臥せり|2る,限り|1る,残り|1る,蹴り|1る,知り|1る,隠れり|2る,握り|1る,通り|1る,齧り|1る,回り|1る,太り|1る,曇り|1る,怒り|1る,釣り|1る,散り|1る,眠り|1る,入り|1る,掘り|1る,飾り|1る,腐り|1る,減り|1る,偽り|1る,踊り|1る,切り|1る,渡り|1る,参り|1る,登り|1る,喋り|1る,乗り|1る,捻り|1る,劣り|1る,混じり|2る,困り|1る,焦り|1る,侍り|1る,寄り|1る",
    "rev": "い換える|3り,こる|1り,行る|1り,消る|1り,なる|1り,わる|1り,張る|1り,かる|1り,がる|1り,まる|1り,る|,ぬ|に,つ|ち,ぐ|ぎ,ぶ|び,む|み,う|い,く|き,す|し"
  },
  "present_progressive": {
    "rules": "けり|1ったでしょう,り|って いる,ね|1て いる,ぜ|1て いる,来|1て いる,べ|1て いる,じ|1て いる,ち|って いる,て|1て いる,せ|1て いる,げ|1て いる,ぎ|いで いる,び|んで いる,め|1て いる,け|1て いる,え|1て いる,い|って いる,み|んで いる,き|いて いる,れ|1て いる,し|1て いる",
    "exceptions": "足り|2て いる,着|1たろう,考え|2たろう,寝|1たろう,似|1て いる,覚え|2たろう,過ぎ|2て いる,開け|2たろう,見|1たろう,出|1たろう,起き|2て いる,降り|2て いる,得|1て いる,落ち|2て いる,食べ|2たろう,借り|2て いる,始め|2たろう,生き|2て いる,浴び|2て いる,喜び|1んで いる,勝ち|1って いる,使い|1って いる,結び|1んで いる,適い|1って いる,歌い|1って いる,救い|1って いる,貰い|1って いる,及び|1んで いる,庇い|1って いる,拾い|1って いる,払い|1って いる,合い|1って いる,学び|1んで いる,習い|1って いる,笑い|1って いる,飛び|1んで いる,誘い|1って いる,飼い|1って いる,吸い|1って いる,持ち|1って いる,育ち|1って いる,狂い|1って いる,並び|1んで いる,転び|1んで いる,向かい|2って いる,選び|1んで いる,追い|1って いる,祝い|1って いる,構い|1って いる,運び|1んで いる,呼び|1んで いる,迷い|1って いる,襲い|1って いる",
    "rev": "けったでしょう|1り,たろう|,遣って いる|1い,伝って いる|1い,立って いる|1ち,違って いる|1い,いで いる|ぎ,んで いる|み,いて いる|き,って いる|り,て いる|"
  },
  "provisional_conditional_negative": {
    "rules": "けり|1って いませんでした,り|らなければ,ごし|2て いません,し|さなければ,ね|1なければ,ぜ|1なければ,に|んで いません,来|1なければ,べ|1なければ,じ|1なければ,ち|たなければ,て|1なければ,せ|1なければ,げ|1なければ,ぎ|がなければ,び|ばなければ,め|1なければ,け|1なければ,え|1なければ,み|まなければ,い|わなければ,き|かなければ,れ|1なければ",
    "exceptions": "足り|2なければ,書き|1いて いません,働き|1いて いません,着|1て いません,洗い|1って いません,歩き|1いて いません,待ち|1って いません,考え|2て いません,思い|1って いません,泊まり|2って いません,立ち|1って いません,話し|2て いません,寝|1て いません,言い|1って いません,走り|1って いません,返り|1って いません,似|1なければ,読み|1んで いません,覚え|2て いません,引き|1いて いません,遊び|1んで いません,過ぎ|2なければ,開け|2て いません,要り|1って いません,会い|1って いません,見|1て いません,聞き|1いて いません,貸し|2て いません,知り|1って いません,急ぎ|1いで いません,出|1て いません,行き|1って いません,起き|2なければ,降り|2なければ,得|1なければ,落ち|2なければ,入り|1って いません,食べ|2て いません,飲み|1んで いません,切り|1って いません,喋り|1って いません,買い|1って いません,沸き|1いて いません,借り|2なければ,始め|2て いません,生き|2なければ,浴び|2なければ,ふけり|2って いませんでした,死に|1んで いません",
    "rev": "ねなければ|1,ぎなければ|1,ぜなければ|1,ちなければ|1,来なければ|1,びなければ|1,きなければ|1,りなければ|1,べなければ|1,じなければ|1,たなければ|ち,てなければ|1,せなければ|1,げなければ|1,がなければ|ぎ,ばなければ|び,めなければ|1,けなければ|1,えなければ|1,まなければ|み,わなければ|い,かなければ|き,れなければ|1,さなければ|し,らなければ|り,けて いません|1,いで いません|ぎ,べて いません|1,めて いません|1,えて いません|1,して いません|1,いて いません|き"
  },
  "provisional_conditional": {
    "rules": "けり|1って いました,り|れば,ごし|2て います,し|せば,ね|1れば,ぜ|1れば,に|んで います,来|1れば,べ|1れば,じ|1れば,ち|てば,て|1れば,せ|1れば,げ|1れば,ぎ|げば,び|べば,め|1れば,け|1れば,え|1れば,み|めば,い|えば,き|けば,れ|1れば",
    "exceptions": "足り|2れば,書き|1いて います,働き|1いて います,着|1て います,洗い|1って います,歩き|1いて います,待ち|1って います,考え|2て います,思い|1って います,泊まり|2って います,立ち|1って います,話し|2て います,寝|1て います,言い|1って います,走り|1って います,返り|1って います,似|1れば,読み|1んで います,覚え|2て います,引き|1いて います,遊び|1んで います,過ぎ|2れば,開け|2て います,要り|1って います,会い|1って います,見|1て います,聞き|1いて います,貸し|2て います,知り|1って います,急ぎ|1いで います,出|1て います,行き|1って います,起き|2れば,降り|2れば,得|1れば,落ち|2れば,入り|1って います,食べ|2て います,飲み|1んで います,切り|1って います,喋り|1って います,買い|1って います,沸き|1いて います,借り|2れば,始め|2て います,生き|2れば,浴び|2れば,罵り|1れば,直り|1れば,脂ぎり|2れば,被り|1れば,触り|1れば,縛り|1れば,練り|1れば,取り|1れば,黙り|1れば,滑り|1れば,座り|1れば,光り|1れば,送り|1れば,叱り|1れば,売り|1れば,実り|1れば,戻り|1れば,殴り|1れば,祈り|1れば,守り|1れば,滅びり|2れば,作り|1れば,臥せり|2れば,限り|1れば,残り|1れば,蹴り|1れば,隠れり|2れば,握り|1れば,通り|1れば,齧り|1れば,回り|1れば,太り|1れば,曇り|1れば,怒り|1れば,釣り|1れば,散り|1れば,眠り|1れば,掘り|1れば,死に|1んで います,飾り|1れば,腐り|1れば,減り|1れば,偽り|1れば,踊り|1れば,渡り|1れば,参り|1れば,登り|1れば,乗り|1れば,捻り|1れば,劣り|1れば,混じり|2れば,困り|1れば,焦り|1れば,侍り|1れば,寄り|1れば",
    "rev": "って いました|り,い換えれば|3り,これば|1り,行れば|1り,消れば|1り,なれば|1り,われば|1り,てば|ち,張れば|1り,かれば|1り,がれば|1り,げば|ぎ,べば|び,まれば|1り,めば|み,えば|い,けば|き,せば|し,れば|,まって います|1り,けて います|1,いで います|ぎ,べて います|1,めて います|1,えて います|1,して います|1,いて います|き"
  },
  "gerund": {
    "rules": "ね|1て,ぜ|1て,に|んで,来|1て,じ|1て,べ|1て,て|1て,せ|1て,ち|って,げ|1て,ぎ|いで,び|んで,め|1て,け|1て,え|1て,み|んで,れ|1て,い|って,き|いて,し|1て,り|って",
    "exceptions": "足り|2て,着|1て,寝|1て,似|1て,過ぎ|2て,見|1て,出|1て,行き|1って,起き|2て,降り|2て,得|1て,落ち|2て,借り|2て,生き|2て,浴び|2て,喜び|1んで,勝ち|1って,洗い|1って,待ち|1って,使い|1って,結び|1んで,思い|1って,適い|1って,歌い|1って,言い|1って,救い|1って,貰い|1って,及び|1んで,庇い|1って,遊び|1んで,拾い|1って,払い|1って,会い|1って,合い|1って,学び|1んで,習い|1って,笑い|1って,飛び|1んで,誘い|1って,飼い|1って,吸い|1って,持ち|1って,育ち|1って,狂い|1って,並び|1んで,転び|1んで,向かい|2って,死に|1んで,選び|1んで,追い|1って,祝い|1って,構い|1って,運び|1んで,買い|1って,呼び|1んで,迷い|1って,襲い|1って",
    "rev": "遣って|1い,伝って|1い,立って|1ち,違って|1い,いて|き,って|り,て|,いで|ぎ,んで|み"
  },
  "volitional_negative": {
    "rules": "ね|1ない　だろう,ぜ|1ない　だろう,に|なないだろう,来|1ない　だろう,じ|1ない　だろう,べ|1ない　だろう,て|1ない　だろう,せ|1ない　だろう,ち|たないだろう,げ|1ない　だろう,ぎ|がないだろう,び|ばないだろう,め|1ない　だろう,け|1ない　だろう,え|1ない　だろう,み|まないだろう,れ|1ない　だろう,い|わないだろう,き|かないだろう,し|さないだろう,り|らないだろう",
    "exceptions": "足り|2ない　だろう,着|1ない　だろう,寝|1ない　だろう,似|1ない　だろう,過ぎ|2ない　だろう,見|1ない　だろう,出|1ない　だろう,起き|2ない　だろう,降り|2ない　だろう,得|1ない　だろう,落ち|2ない　だろう,借り|2ない　だろう,生き|2ない　だろう,浴び|2ない　だろう",
    "rev": "なないだろう|に,たないだろう|ち,がないだろう|ぎ,ばないだろう|び,まないだろう|み,わないだろう|い,かないだろう|き,さないだろう|し,らないだろう|り,ない　だろう|"
  },
  "volitional": {
    "rules": "ね|1よう,ぜ|1よう,に|のう,来|1よう,じ|1よう,べ|1よう,て|1よう,せ|1よう,ち|とう,げ|1よう,ぎ|ご,び|ぼ,め|1よう,け|1よう,え|1よう,み|もう,れ|1よう,い|おう,き|こう,し|そう,り|ろう",
    "exceptions": "足り|2よう,着|1よう,寝|1よう,似|1よう,過ぎ|2よう,見|1よう,出|1よう,起き|2よう,降り|2よう,得|1よう,落ち|2よう,借り|2よう,生き|2よう,浴び|2よう",
    "rev": "のう|に,とう|ち,もう|み,おう|い,こう|き,そう|し,ろう|り,よう|,ご|ぎ,ぼ|び"
  }
}