export default [
  // And:
  'と、',//(to)
  'や、',// (ya)
  'そして',// (soshite)

  // Also:
  'も、',//(mo)
  'もまた',// (mo mata)

  // Then:
  'そして、',// (soshite)
  'それから',// (sorekara)

  // Or:
  'または、',//(mata wa)
  'また',// (mata)


  // But:
  'しかし、',//(shikashi)
  'が、',//(ga)
  'けど',// (kedo)
  'けれども',// (keredomo)
  'なのに',// (nanoni)
  'でも',// (demo)

  // However:
  'しかしながら',//、 (shikashinagara)
  'ところが',// (tokoroga)

  // Despite:
  'にもかかわらず',// (nimokakawarazu)

  // So:
  'それで、',//(sorede)
  'なので',// (nanode)

  // And then:
  'それから、',//(sorekara)
  'その後',// (sonogo)

  // Therefore:　
  'それゆえに、',//(soreyue ni)
  'だから、',//(dakara)
  'したがって',// (shitagatte)

  // Thus:
  'ゆえに、',//(yue ni)
  'したがって',// (shitagatte)

  // and
  'と',//(to)
  'や',// (ya)
  'そして',//(soshite)

  // if
  'もし',//(moshi)
  'たら',// (tara)
  'なら',// (nara)
  'すると',// (suruto)

  // so
  'だから',// (da kara) 
  'から',// (kara)
  'ので',// (node)
  'ため',// (tame) 
  'のため',// (no tame)

  // because
  'なぜなら',// (nazenara)

  // however
  'しかし',// (shikashi)
  'でも',// (demo)
  // 'が',// (ga)
  'だが',// (daga)
  'ところが',// (tokoroga)
  'なのに',// (nanoni)
  'けど',// (kedo)
  'けれども',// (keredomo)

  //or
  'または',// (matawa) 
  'もしくは',// (moshikuwa)
  'か',// (ka)
  'あるいは',// (aruiwa)

  // by the way
  'ところで',// (tokorode)

  // on the otherhand
  '一方で',// (ippō de)

  // for example
  '例えば',// (tatoeba)

  // in addition
  'さらに',// (sarani) 
  'その上',// (sonoue)


  'かくして',
  'すると',
  'ですけれど',
  'だって',
  'なかんづく',
  '然し乍ら',
  '即ち',
  'さもなければ',
  'けれども',
  'けれど',
  'ほんなら',
  'つまるところ',
  'てゆーか',
  'ほんで',
  'なので',
  'そうしたら',
  '否',
  '否',
  'かつ',
  'と同時に',
  '実は',
  'ならびに',
  'または',
  'ですが',
  '然しながら',
  'こうして',
  'したら',
  'いっぽう',
  'そもそも',
  'では',
  'そういや',
  'かたや',
  'それでは',
  'だとすれば',
  'それにしても',
  'なのに',
  'それでも',
  'しかしながら',
  '然し',
  '次いで',
  'ただ',
  'とすれば',
  '若しくは',
  'だから',
  'そのうえに',
  'つまり',
  'なぜなら',
  'ちなみに',
  '追って',
  'じゃが',
  'そしたら',
  'ないし',
  'でないと',
  'たとへば',
  'しかも',
  'まずは',
  'おまけに',
  'それどころか',
  '次に',
  'ですから',
  'だからこそ',
  'だけど',
  'それも',
  'どころか',
  '或は',
  '亦',
  'そのうえで',
  'で',
  'そこで',
  '故に',
  '譬えば',
  'されど',
  'そやさかい',
  'じゃあ',
  'よって',
  'そうして',
  'ぎゃくに',
  'なかんずく',
  'おしむらくは',
  'ともあれ',
  'それとも',
  '及び',
  'わけても',
  'ところで',
  '惜しむらくは',
  'それに',
  '尤も',
  'というのも',
  '恐れながら',
  '併せて',
  'しかし',
  'たとえば',
  'それなのに',
  'ともに',
  'が',
  'あるいは',
  'そして',
  'それなら',
  'でなければ',
  'ふんじゃ',
  'ほんじゃ',
  'ところが',
  'ほなら',
  'したがって',
  'さらに',
  'けど',
  '乃至',
  '例へば',
  '逆に',
  'じゃ',
  'だからといって',
  'てか',
  '譬へば',
  'いえ',
  'だが',
  'および',
  'そうですが',
  '或いは',
  'それでいて',
  'そーいや',
  'そりゃ',
  'ゆえに',
  'それで',
  '但し',
  'んじゃ',
  'おそれながら',
  'さて',
  'おなじく',
  'はんめん',
  '例えば',
  'ってか',
  'ともすれば',
  'そういえば',
  'さりとて',
  'ほな',
  'ただし',
  'ましてや',
  'にもかかわらず',
  '但',
  '因みに',
  '本当は',
  'でも',
  '又',
  'もっとも',
  'また',
  '一方',
  'それだけに',
  '又は',
  'ついては',
  'そうすると',
  'いや',
  'そのうえ',
  'ついで',
  'それと',
  'だとすると',
  '尚',
  '同じく',
  'すなわち',
  '並びに',
  'なお',
  'そうなると',
  'それから',
  '反面',
  'あわせて',
  'もしくは',
  '従って',
  'だけれども',
  'ならば',
  'ないしは',
  'なら',
]