export default [
  // me
  'わたし', '私',
  'わたくし', '私',
  'われ', '我, 吾',
  'わが', '我が',
  'おれ', '俺',
  'ぼく', '僕',
  'わし', '儂',
  'じぶん', '自分',
  '', '俺様',
  'あたい', '',
  'あたし', '',
  'あたくし', '',
  'うち', '家, 内',
  '', '',
  'おいら', '',
  'おら', '',
  'わて', '',
  'しょうせい', '小生',

  //you
  'あなた', '貴方, 貴男, 貴女',
  'あんた', '',
  'おたく', 'お宅, 御宅',
  'おまえ', 'お前',
  'てめえ', 'てまえ', '手前',
  'きさま', '貴様',
  'きみ', '君',
  'きか', '貴下',
  'きかん', '貴官',
  'おんしゃ', '御社',
  'きしゃ', '貴社',

  // he/she
  'あのかた', 'あの方',
  'あのひと', 'あの人',
  'やつ', '奴',
  'こいつ', 'こやつ', '此奴',
  'そいつ', 'そやつ', '其奴',
  'あいつ', 'あやつ', '彼奴',
  'かれ', '彼',
  'かのじょ', '彼女',

  // we
  'われわれ', '我々',
  'われら', '我等',
  'へいしゃ', '弊社',
  'わがしゃ', '我が社',
  '私たち',

  // they
  'かれら', '彼等'
]