export default `コーヒー（koffie 、coffee）は、コーヒー豆（コーヒーノキの種子）を焙煎して挽いた粉末から、湯または水で成分を抽出した飲料. 歴史への登場は酒や茶には遅れるが、世界各地 で愛飲されている嗜好飲料である. 家庭や飲食店、職場などで飲用され、コーヒーの専門ショップも多数存在する. 抽出前の粉末や粉砕前の焙煎豆も、同じくコーヒーと呼ばれることもある. 日本語での漢字表記は「珈琲」.

世界各国において、コーヒーを提供する場の喫茶店（コーヒー・ハウス、カフェ、カフェー）は近代、知識人や文学、美術など様々な分野の芸術家の集まる場として、文化的にも大きな役割を果たしてきた. カフェインに代表される薬理活性成分を含むことから医学・薬学の面から研究の対象となっている. さらに、貿易規模が大きい一次産品とされることもある ため、経済上でも重要視されている.

コーヒーは北回帰線と南回帰線の間（コーヒーベルト）の約70カ国で生産されており、そのコーヒー農園でコーヒーノキの栽培と果実の収穫が行われる. さらに引き続いて、生豆（なままめ、きまめ、焙煎前のコーヒー豆のこと）を取り出すコーヒー豆の精製と呼ばれる加工作業までが、コーヒー農園で行われることが多い. 精製された生豆は生産国で集積され、選別・等級付けされてから消費国に輸出される. 生豆は消費地においてコーヒー独特の香味を生み出すために焙煎され、場合によっては複数の焙煎豆を混ぜてブレンドされる. その後粉砕により細かい粉状にされてから、水や湯で抽出されて、飲用に供されるコーヒーが出来上がる.

コーヒーがいつ頃から人間に利用されていたかは、様々な説があり、はっきりしていない. 果実（コーヒーチェリー）の赤い果肉は甘く食べられるため、種子の効用を知る機会も多かったと考えれば、有史以前から野生種が利用されていても不思議ではない. 実際、アラビカ種は原産地エチオピアで古くから利用されていたとする説があり、リベリカ種は西アフリカ沿岸でヨーロッパ人が「発見」する以前から栽培・利用されていた.

現在見られる「焙煎した豆から抽出したコーヒー」が登場したのは13世紀以降と見られる.

最初は一部の修道者だけが用いる宗教的な秘薬であり、生の葉や豆を煮出した汁が用いられていた. しかし、焙煎によって嗜好品としての特長を備えると一般民衆へも広がり、1454年には一般民衆の飲用が正式に認められ、中東・イスラム世界全域に拡大した. オスマン帝国からバルカン諸国、ヨーロッパには16世紀に伝わり、1602年のローマ以降、17世紀中にヨーロッパ全土に伝播した. 北米には1668年、ヨーロッパからの移民によって伝わった.

日本へは18世紀末にオランダ人が長崎の出島へ持ち込み 、最初の記録は、1804年の大田南畝による随筆『瓊浦又綴』（けいほゆうてつ）.

抽出法も工夫され、挽いたコーヒー豆を煮出して上澄みを飲むトルココーヒー式の淹れ方から、まず布で濾す方法（1711年 フランス）が開発され、布ドリップ（ネルドリップ）の原型となった. これに湯を注ぐ器具として、ドゥ・ベロワのポット（1800年頃 フランス）が考案され、現在のドリップポットに至る. この他にも、パーコレータ（1827年 フランス）、コーヒーサイフォン（1830年代 ドイツ）、エスプレッソマシン（1901年 イタリア）、ペーパードリップ（1908年 ドイツ）などが開発され、多様な飲み方が可能となった.
 * イスラム世界では、長らくイスラム教の戒律との関わりから一般民衆の飲用を認めない主張が続いた. 1454年にファトワが出された後も、反対意見は根強く、16世紀頃から一般民衆への普及によって民衆の社交場においてコーヒーが供される風習が生じると、1511年、厳格なイスラム戒律主義者だったメッカ総督がコーヒーを「大衆を堕落させる毒」として飲用を禁じ、焼き捨てを命じたメッカ事件が起きている.
 * そのメッカから伝わったオスマン帝国では、17世紀初頭に世界初の近代的なコーヒー・ハウスが首都イスタンブール（旧称コンスタンティノープル）で開業した. コーヒーハウスは中上流階級の社交場となり、コーヒーが伝わった先のヴェネツィアやローマでも同様なコーヒーハウスが開業して、ヨーロッパ中に広まった.
 * イギリスでは1650年にオックスフォードに最初のコーヒーハウスが開業した後、17世紀にはロンドンを中心にコーヒーハウスが社交や議論、情報交換の場として隆盛を極めた. ロイズの前身もコーヒーハウスである. このイギリスのコーヒーハウスの隆盛は紅茶の普及により廃れる18世紀半ばまで続いた.
 * フランスでは1669年には駐トルコ大使がルイ14世に献上したことがきっかけになって上流社会で流行し、さらに一般にも広まって多くのカフェが作られた. 1867年ごろには、朝食時にミルクと砂糖を入れたコーヒーを飲む習慣があった.
 * ウィーンでは、1683年、オスマン帝国による第二次ウィーン包囲が失敗した際に、オスマン軍が塹壕に残していったコーヒー豆をが戦利品として拝領し、ウィーン初のコーヒーハウスを開業したのが始まりといわれている.
 * 日本では江戸時代から長崎を通して貿易品として輸入されていたが、嗜好品と言うよりも薬としての効果を期待されたもので、水腫に効果があるとされていた. これはコーヒーに含まれるビタミンの効用と考えられる. 1807年の樺太出兵では野菜が摂取できないことによる兵の水腫病が問題になり、幕府から貴重なコーヒー豆が支給されたという. 1855年頃、やはり寒さなどで殉難が多かった弘前藩士の為に幕府が薬用としてコーヒーを用意したという記録も残っている . 1867年、万国博覧会に出席する徳川昭武の随員としてパリを訪れた渋沢栄一は「食後カッフへエーという豆を煎じたる湯を出す砂糖牛乳を和して之を飲む頗る胸中を爽やかにす」と『航西日記』に記しており、これが嗜好品として飲まれたコーヒーの最も古い記述とされる . また昭武が記した『徳川昭武幕末滞欧日記』には複数のコーヒーを飲んだ記述や、紅海を移動中に見たモカの街について「優れたコーヒーの産地である」と書いた箇所がある . 1888年4月13日、東京下谷に最初の喫茶店「可否茶館」が開店、明治時代末から大正時代にかけて（1911年 - ）、カフェーと呼ばれる喫茶店が全国的に普及した. 1889年には東京の氷砂糖問屋が珈琲挽茶入角砂糖を売り出し、湯または牛乳に溶かして飲ませた.

現代では世界各地でよく飲まれている. 国際コーヒー機関によると、2017年における1人当たり年間消費量の上位国はアイスランド（9.26kg）、ノルウェー（8.84kg）、スイスとボスニア・ヘルツェゴヴィナ（ともに6.33kg）、カナダ（6.29kg）、ブラジル（6.26kg）の順で、日本は3.64kg（12位）である.

2014年、国際コーヒー機関は2015年から10月1日を「国際コーヒーの日」とすることを決めた.

「コーヒー」はアラビア語でコーヒーを意味するカフワ（قهوة：qahwa）が転訛したものである. 元々ワインを意味していたカフワの語が、ワインに似た覚醒作用のあるコーヒーに充てられたのがその語源である. 一説にはエチオピアにあったコーヒーの産地カッファ（Kaffa）がアラビア語に取り入れられたものともいわれている.

この語がコーヒーの伝播に伴って、トルコ（kahve）、イタリア（caffè）を経由し、ヨーロッパ（café、Kaffee、coffee）から世界各地に広まった. 日本語の「コーヒー」は、江戸時代にオランダからもたらされた際の、koffie（コーフィー）に由来する. かつては前述の『航西日記』のように現地（フランス）の発音をそのまま書き取った記述もあった.

日本では漢字で「珈琲」のほか「可否」「架非」「加非」「咖啡」などの字も当てられてきた.

漢字による当て字である「珈琲」は、江戸時代末期の医蘭者宇田川榕菴（うだがわ ようあん）が考案し、自筆の蘭和対訳辞典に記載したのが、最初であると言われている. これ以外にも、「可否」（可否茶館）、「カウヒイ」（大田南畝『瓊浦又綴（けいほゆうてつ）』）、「哥非乙」（宇田川榕菴『哥非乙説』） などの表記も過去には用いられた.

なお、中国語においても、訳語に関して19世紀に試行錯誤があり、当時の日本語の当て字を借用して現在に至るものとされている. ただし、漢字は口偏で「咖啡」（）と表記される.



全世界では、約150億本のコーヒーノキが1000万ヘクタールの土地で生育していると概算されている. 主な生産地はブラジルやコロンビアなどの中南米や、ベトナム、マレーシア、インドネシアなどの東南アジア、エチオピアやタンザニア、ケニアなどのアフリカ諸国など. また有名銘柄の産地としてハワイ、イエメンなどがある. また、インドや中国などでも生産されている. 日本でも小笠原諸島や沖縄諸島に移入されたことがあるが、大規模生産には成功していない. ただし九州の鹿児島県徳之島や沖永良部島、沖縄、小笠原諸島では個人農園で栽培している.

近年になってこれまでロブスタ種の栽培が主流であったタンザニア周辺地域のアフリカ諸国、（ザンビアやマラウィ等）で輸出用に高品質のアラビカ種の栽培が盛んになっている. 一部国連主導による「国連グルメコーヒー開発プロジェクト」に加盟している国もある（ブルンジ、ウガンダ）. これらのアフリカ諸国のコーヒーも日本で漸く流通し始めている.

コーヒー豆の種類は、主に生産地で分類されている. 品種名は、国名（コロンビア、ケニア、コスタリカ等）、山域（キリマンジャロ、ブルーマウンテン、エメラルドマウンテン等）、積出港（モカ、サントス等）、栽培地名（コナ、マンデリン、ジャワ等）などにちなむ. この他、種名や栽培品種の名を付加した名称（ジャワ・ロブスタ、ブルボン・サントス）や、選別時の等級を付加した名称（ブラジル No.2、タンザニアAA）なども用いられている.

スペシャルティーコーヒーの概念も普及しつつある. すなわち、生産地、生産者、収穫後の生産処理方法、流通経路、焙煎・抽出・提供の一連の流れが品質管理されていることである.

コーヒーの原料となるコーヒー豆は、3 - 3.5mほどの常緑低木で、ジャスミンに似た香りの白い花を咲かせるコーヒーノキの果実から得られる.

コーヒーチェリーと呼ばれる果実は赤または紫、品種によっては黄色の硬い実で、成熟に9ヶ月ほどかかる. 通常は1果実に2粒の種子が入っている. まれに1果実に1粒の種子が入っている「ピーベリー」と呼ばれる種子がありこれは珍重される. コーヒー豆となる種子だけでなく、果肉部分にも若干のカフェインが含まれており、食用にされることがある.

コーヒーノキは、エチオピア原産のティピカ種（Tipica）に由来するアラビカ種（Coffea arabica）と、コンゴ原産のロブスタ種（カネフォーラ種、C. canephora）、リベリカ種（C. liberica）があり、合わせて「コーヒーの3原種」と呼ばれる.

このうち現在栽培されているコーヒーノキはアラビカ種とロブスタ種がほとんどで、中でも生産量の7-8割はアラビカ種が占める. 20世紀前半まではリベリカ種の栽培も盛んだったが、病害に弱く品質面でも劣るため、21世紀前半の現在では生産量も1割以下となっている. なお、ロブスタ種についてはコンゴより1年早く1897年にガボンで発見され、正式学名の由来となった.

栽培品種はアラビカ種を中心に200種類以上が知られ、ブラジルとコロンビアで盛んに育種が行われている. その一方で、コーヒーの風味において従来品種を高く評価する人もおり、フェアトレード運動とも連動している.


 * アラビカ種
 * 病害虫や霜、少雨等に弱く栽培が困難だが、風味とコクに優れ、レギュラーコーヒー用を主体として多様な品種がある. 総生産量の約70%を占める.
 * 従来は、ブラジルのブルボンとコロンビアのティピカが、アラビカ種の2大品種と呼ばれ主力品種だった. その後、収量や耐病虫性に優れた品種への置換が進み、最近ではブラジルのカトゥーラ、カトゥアイとムンド・ノーボ、コロンビアのカトゥーラとバリエダ・コロンビアが、それぞれ主力品種となっている.
 * このほか、スマトラ、モカ（銘柄とは別）、ブルー・マウンテン（ブランドとは別）、コナ、マラゴジッペ、アマレロ、ゲイシャなどがある.
 * ロブスタ種
 * アラビカ種に比べて耐病性が高く、少雨、高温多湿の土地でも栽培できる. また安定収穫までにかかる期間が3年と短い. 栽培が容易なので収量も多く、生産量2位のベトナムで主力となっている.
 * 抽出しやすく水出しも容易だが、カフェイン成分が多く苦みやクセ（ロブスタ臭）が強く、日本やアメリカでは単独での風味はアラビカ種に及ばないとされる. インスタント用原料や、安いレギュラーコーヒーの増量用が主体となっている他、いわゆるベトナムコーヒーに用いられる. また、イタリアやフランスで愛飲されるエスプレッソコーヒーにはロブスタ種を主体としたブレンドが使われ、独特のコクと苦みをもたらすとされる.
 * リベリカ種
 * 高温多湿の気候に適応するが病害に弱く、品質もアラビカ種に及ばない.
 * 交雑種
 * アラビカとロブスタを交配したもので、一般的なレギュラーコーヒーに用いられる.
 * ハイブリド・デ・ティモール、アラブスタ、カティモール、バリエダ・コロンビアなどの品種がある.

代表的なコーヒー豆の味や特徴を挙げる. 産地国を名としないものは括弧書きで産地国を付記する. なおレギュラーコーヒーに使われるものはアラビカ種またはロブスタ種が主流の雑種である.


 * ブルーマウンテン（ジャマイカ）
 * 卓越した香気を持ち、調和の取れた味わい、軽い口当りと滑らかな咽越しが特徴. 最高級の品質と呼ばれる. ジャマイカで生産されるコーヒーのうち、ごく一部の産地のものがブルーマウンテンとブランド付けられる. その中でもさらにランク付けがなされる.
 * ハワイ（米国）
 * コナ（ハワイ島）
 * 非常に強い酸味とコク・風味を持つ. ブレンドに用いると良質な酸味が与えられるといわれる. ブルーマウンテンに次ぐブランドで高価である.
 * モロカイ（モロカイ島）
 * キリマンジャロ（タンザニア）
 * タンザニア産のコーヒーの日本での呼称. 強い酸味とコクが特長. 「野性味あふれる」と評されることが多い. 深い焙煎では上品な苦味主体で浅 - 中煎りとは違った風味が楽しめる.
 * モカ（イエメン、エチオピア）
 * 香気に優れ独特の酸味を持ち、甘みとコクが加わる. もっとも古い「ブランド」である. コーヒー原産地であり、イタリアなどではコーヒーのことをモカと呼ぶ. イエメン産の「マタリ」 、エチオピア産の「ハラー」「シダモ」等が有名.
 * グアテマラ
 * 酸味とコクに優れ、香気も良好で全体的に華やかさとキレのいい後味が特徴.
 * ブラジル
 * 香りの甘さが軽快で酸味・コク、苦みともに軽くバランスが良い. 安価でありブレンドのベースとして多く使われる.
 * コロンビア
 * 酸味と甘味が重厚だが突出せずバランスが良い. 安価でありブレンドのベースに使われることも多い. コーヒーの基本の味.
 * マンデリン（インドネシア）
 * スマトラ島産. 苦味とコクを中心とした味わい、酸味はなく独特な後味がある. 日本ではブルーマウンテンが現れるまでは世界一と評されていた.
 * トラジャ（インドネシア）
 * スラウェシ島産. 苦みが中心の味で、非常に濃厚なコクを持つ. 酸味は無い. カロシ・トラジャもしくは単にカロシという名称が使われる.
 * ジャワコーヒー（インドネシア）
 * ジャワ島産の主にアラビカ種コーヒーを指す. かつての大産地でモカとブレンドしたモカジャバは最初のブレンドといわれるが、葉さび病と経済恐慌で産地が大打撃を受けて以降は産出量が少ない. 現在手にはいるものは丸くマイルドな味. ジャワ島は専らアイスコーヒー・エスプレッソ・工業用に使用されるロブスタ種の主要な産地であるため、限定してアラビカ種を指す場合はジャワ・アラビカともいう.
 * ケニア
 * フルーツのような爽やかな風味が特徴. 全体的に強い風味でバランスが良い. ドイツなどヨーロッパではタンザニア産とともに一般的な銘柄. 深めの焙煎が多い.
 * サルバドル（エルサルバドル）
 * 強く主張する味は無く、全体に甘く上品で柔らかな印象の味わい.
 * コスタリカ
 * どちらかというと酸味系で苦味控えめの味わい、軽めでクリアな飲み口.
 * パプアニューギニア
 * 浅い焙煎では軽くてクセの少ない風味、深い焙煎ではキレの良い強い苦味とコクのある風味. 良質な香気も特徴. 最高級品質と言われるブルーマウンテンの苗木をそのまま移植して栽培した品種である.
 * キューバ
 * ブルーマウンテンに似た軽くてバランスの良い風味と上品な香気が特徴. ドミニカ共和国やハイチなどカリブ海地域の島国産のコーヒーは総じて似た傾向の風味を有する.
 * インド
 * インドのコーヒー栽培は400年以上の歴史があり、世界中のコーヒー産地の中でも有数の歴史と伝統を誇る. 森の生態系を活かしながら有機的な農法で育てられ、5 - 6月に吹くモンスーンを利用した、約7週間を経てできる独特の香味は、欧米の多数の国で愛飲されている最高級品である.
 * ベトナムなどアジア地域
 * ベトナムやネパール、中国など近年になって輸出向けにアラビカ種を導入した地域では、人気のある中南米地域の品種の苗木を導入しているが気候や土壌、生産技術の違いからか同じ品種でも独特の風味を持つ. 総じて中南米地域産に比べてやや重めの風味になり、酸味は控えめで香気もやや弱くなる傾向がある.

日本でも、沖縄県・小笠原・鹿児島県で、少量だが栽培が行われている.



収穫されたコーヒーの果実からコーヒー豆を取り出す工程をコーヒーの精製と呼ぶ. コーヒーの精製には主に乾式（乾燥式・非水洗式）と湿式（水洗式）の2種類がある. 単純作業のため、コーヒーの精製は生産地で行われる. 精製を済ませたコーヒー豆は生豆と呼ばれ、カビなどの発生を防ぐために水分含量が10 - 12%になるよう乾燥して保管され、消費地に輸出される.


 * 乾式（乾燥式・非水洗式）
 * 収穫した果実を乾燥場に平らに広げて天日で干し、完全に乾燥した果肉を機械的に除く. モカ及びマンデリンの産地とブラジルで行われることが多い.
 * 湿式（水洗式）
 * 外皮と果肉を機械的に取り除いた後で、水槽に1、2日つけて発酵させて種子（パーチメントコーヒー）を取り出す方法. コロンビアなど、ブラジル以外の産地で行われることが多い.

この他、乾式と湿式を組み合わせた半湿式（半水洗式）や、ジャコウネコなどの動物に食べさせて、その糞から取り出すもの（コピ・ルアク）などがある.

精製された生のコーヒー豆は次に焙煎されて、初めて実際に我々が口にするコーヒーの香りと味を生み出す. 多くの場合、この工程は消費国でなされ、ロースターと呼ばれる大手のコーヒー豆卸業者が行うほか、コーヒー豆小売りを行う販売店や喫茶店などで自家焙煎される. また家庭で生豆から焙煎することも可能であり、近年は専門店等で生豆の小売も多く見られる.

日本の家庭ではフライパンや焙烙（ほうろく）、ギンナン煎りに用いる金属製の手網などで焙煎することがあるが、プロの多くは焙煎機（コーヒーロースター）と呼ばれる専用の機械で行われる. これらの焙煎方法は加熱原理と熱源の違いによって以下のように分類される.
 * 直火焙煎
 * 熱風焙煎
 * 遠赤外線焙煎
 * マイクロ波焙煎
 * 過熱水蒸気焙煎（日本独自のものである）

上記が同時に進行するような焙煎方法もある.
 * 半直火焙煎…熱風焙煎と直火焙煎
 * 炭火焙煎（日本独自）…熱風焙煎と遠赤外線焙煎
 * セラミック焙煎（日本独自）…直火焙煎と遠赤外線焙煎

コーヒーが焙煎される時豆の温度は約200程度まで到達する. 一般的な焙煎方法ではおよそ10 - 20分程度の加熱時間を必要とする.

焙煎の度合いのことを焙煎度といい、焙煎度の低いものを浅煎り、高いものを深煎りと呼ぶ. 浅煎りされたコーヒー豆は薄い褐色で、深煎りへと進行するにつれて黒褐色へと変化し表面に油がにじみ出てくる. 浅煎りと深煎りの中間にあたるものを中煎りと呼ぶこともあるが、これらは相対的な呼び名であって明確に定められているものではなく、販売店舗などによっても異なる. また、日本では以下の8段階（浅煎り→深煎りの順）の焙煎度を用いる場合もある.
 * 1) ライト(light)
 * 2) シナモン(cinnamon)
 * 3) ミディアム(medium)
 * 4) ハイ(high)
 * 5) シティ(city)
 * 6) フルシティ(Full city)
 * 7) フレンチ(French)
 * 8) イタリアン(Italian)

一般に、浅煎りは香りや酸味に優れ深煎りは苦味に優れると言われているが、嗜好の問題であるため、総合的に見てどちらかが優れているということは特にない. 通常使われる焙煎度は、ミディアムからイタリアンである.

コーヒー豆はその消費目的に応じて数種類混合されることがある. これをブレンドと呼ぶ. ブレンドされたコーヒーはブレンドコーヒーと呼ばれ、これに対して一種類の焙煎豆のみからなるコーヒーをストレートコーヒーと呼ぶ.

ブレンドは焙煎前に豆を混合するプレミックスと焙煎後に混合するアフターミックスがある. プレミックスは調和の取れた味になり大量生産にも向いている 一方で、個々の豆の焙煎の加減を調整しづらい. それに対してアフターミックスは豆の焙煎状態を最良にしやすいが、別々に焙煎する分手間が掛かる.

ブレンドは複数の違った持ち味を持つコーヒーを混ぜることにより、ストレートコーヒー単品だけではなし得ない味を、提供者側の意図にあわせて作り上げるための工程である. しかしながらその法則には定まったものがあるわけではなく、各ロースターが独自に考案したブレンドのレシピに従って行われる. インスタントコーヒーなど工業的生産の場では、香味等の品質を保つため8つ以上のタイプの豆が混合される.

一方でストレートは使うコーヒー豆を生産国だけでなく、地域や農園単位で限定して、それを売り物にすることもある. 産地ごとに異なるコーヒーの味や香りを、相性が良い菓子や料理と組み合わせて楽しむ「フードペアリング」という飲み方も行われている.

焙煎されたコーヒー豆は、抽出される前に粉状に細かく挽かれる. この工程をコーヒーの粉砕（グラインド）という. 粉砕にはコーヒーミルあるいはグラインダーを用いる. 場合によっては乳鉢や臼|石臼などが用いられる. コーヒーは焙煎された豆のままで販売されるか、工場で粉砕された後で販売される. 粉砕されると表面積の増加から空気酸化による品質低下が早まると言われているため、家庭用のコーヒーミルで抽出直前に挽いている人もいる.

粉砕されたコーヒーは粉の大きさに応じて、細挽き、中挽き、粗挽きと呼ばれる. 粉砕粒子度合いと抽出法については、アメリカ商務省の推奨規格やそれを規定した専門書（具体的数値はコーヒーミルを参照）などがある. しかし多くの場合はそれらに直接従うことは少なく、当事者の経験や大まかな伝聞によって粒子度合いを決めていると考えられる. これらの挽き具合は、そのコーヒーがどのように抽出されるか、またどのような味にすることを望むかによって調整される. 例えばエスプレッソではほとんど微粉に近い粉状になるよう極細挽きにして用いられる. このためエスプレッソ用のコーヒーミルは臼刃式が用いられる.

飲み物としてのコーヒーは、直前にコーヒー豆から抽出して飲むレギュラーコーヒーと、レギュラーコーヒーから工業的に作られるもの（インスタントコーヒーや缶コーヒーなど）に大別できる. コーヒーの淹れ方や飲み方は地域によって多様であり、また個人の嗜好によっても大きく異なる.

焙煎されて粉砕されたコーヒーの粉に、湯または水を加えることで中の成分を抽出し、飲用のコーヒーが出来上がる. この時の抽出方法、すなわちコーヒーの淹れ方には様々な方法や器材が存在する. それぞれの淹れ方は用いる器具の名前で呼ばれることが多い.

コーヒーの風味は、焙煎の度合いや挽き加減（細かく、粗く等）、淹れ方や用いる器具などにより異なる. それぞれの持ち味と嗜好の問題であるため、万人にとっての最善の方法は存在しない. ただし一般に、焙煎、挽いた粉の保管、抽出後のいずれの段階でも酸化が進むので、各段階での時間経過が短い方が香りも味わいも優れている.


 * ドリップ
 * ウォータードリップ（水出し）
 * 専用の器材を用いて水でコーヒーを抽出する方法. 点滴のように少しずつ水を落として抽出するため、1杯当たり8時間程度を目安とする. 抽出する器具もインテリアとして活用される. 近年、安価な器具が登場し、一般の家庭でも楽しめる. オランダ領時代のインドネシアで、ドリップ式では苦みが強く出てしまうロブスタ種のコーヒー豆から抽出するために考案されたことから「ダッチコーヒー」とも言う. 現在ではアラビカ種の豆にも用いられており、繊細な風味を活かすための方法である.
 * ペーパードリップ
 * ドリッパー（一種の漏斗）にフィルタ（漉紙）をセットし、粉を入れ適量の湯を注ぎ、30秒程度蒸らした後に抽出を開始する. ドリッパーの湯が完全に切れる前に外すと雑味が抑えられたコーヒーとなる.
 * 前述の手順さえ守れば誰でも一定水準のコーヒーが淹れられるのがこの方式の最大の利点である. 湯の温度を上げることで苦味が、また温度を下げることで甘みが増えるなど、風味を調節できる. 欠点としてフィルタは1回ごとに使い捨てとなる. またフィルタの匂いや成分が混ざること、油分が紙に吸われるためアロマが弱くなることがあるが、いずれも抽出前にペーパーを湯通しすることで軽減できる.
 * ペーパードリップの方法は、1908年にドイツ人のメリタ・ベンツ（Melitta Bentz）が考案した. 彼女はペーパードリップシステムの特許を取得し、メリタを創業した.
 * メリタ式（抽出穴1つ）とカリタ式（同3つ）が存在し、最適なメッシュ（挽き具合）が異なるとされているが、どの挽き方が最適かは様々な意見がある. 抽出法の違いは、メリタ式が杯数分の湯を全量フィルタに投入し滴下するのを待つのに対し、カリタ式は湯を数回に分けて投入し続けるので、味がぶれる要素は大きい.
 * ドリッパーの形状はメリタが開発した台形が主流であるが、近年では円錐形も登場している. 台形は腕に左右されず安定した味と香りが出せ 、円錐形は粉の層が縦に厚くなりよりネルドリップに近くなるとされる. 台形と円錐形ではフィルタの互換性が無く、HARIOは両方のドリッパーとフィルタを販売しているが円錐形の方が若干高価である. メリタとカリタは台形のみ、珈琲サイフォン株式会社は円錐形のみ販売している.
 * その他の抽出法として、松屋式やコーヒーバネット等の螺旋状の金属枠にペーパーをセットして抽出する方法や、湯とコーヒー粉を容器で混合し、浮いてくる灰汁を取り除いた後にペーパーで濾して飲む方法、あるいは一端にフィルタのセットされた外筒の中で湯とコーヒー粉を混合し、ゴムシールのついた内筒を押し込むことで空気圧をかけてろ過する（エアロプレス）もある.
 * ネルドリップ
 * フィルタとして布（フランネル）を使用する抽出法. 布と紙の材質の違いからペーパードリップよりもコーヒーに含まれる油分がより抽出される. ペーパーでの抽出に比べてまろやかでボディ感のある味となる傾向があり、またペーパードリップのように紙の影響を受けない. 味と香りは、湯の温度や注ぎ方などの抽出方法に大きく左右される.
 * ネルの取り扱いには注意を要する. 使用後のネルはコーヒーの油膜の酸化を避けるため、直ちに洗浄し、冷水に浸けて保存する. 臭いが移るのを避けるため、洗浄の際は洗剤の類を使用しない. 新品のネルは抽出済みのコーヒー粉を入れた湯で煮沸し、洗浄後に使用する.
 * その他の濾過材
 * 濾過材に水分透過性のある岩石（溶岩など）やセラミックス、合成繊維（ナイロンなど）や金属（ステンレス鋼など）の網など洗浄すれば再利用できる物も登場している. ペーパーフィルタ用のドリッパーにセットできる製品もあり、より経済的とされる. また濾過材の種類よって様々なドリップ法が考案されている.
 * エスプレッソ/マキネッタ
 * 高温、高圧をもって一気に抽出するエスプレッソマシンと、飽和水蒸気による圧力使用する直火式のマキネッタがある. 詳細はエスプレッソ項を参照のこと. イタリア、フランス、スペイン、ポルトガルといった南欧諸国では一般にコーヒーといえばこのエスプレッソを指す. 一杯分の豆から30ml程度しか抽出せず極めて濃厚な風味と強い苦みを持ち、通常、砂糖を入れて飲む. また各種ミルク入りコーヒードリンクのベースともなっている.
 * 高温、高圧をもって一気に抽出するエスプレッソマシンと、飽和水蒸気による圧力使用する直火式のマキネッタがある. 詳細はエスプレッソ項を参照のこと. イタリア、フランス、スペイン、ポルトガルといった南欧諸国では一般にコーヒーといえばこのエスプレッソを指す. 一杯分の豆から30ml程度しか抽出せず極めて濃厚な風味と強い苦みを持ち、通常、砂糖を入れて飲む. また各種ミルク入りコーヒードリンクのベースともなっている.


 * コーヒーサイフォン
 * サーバと漏斗から構成され、漏斗部にネルまたはペーパーフィルタをセットし、粉を入れる. サーバ部に水をいれ、加熱し、湯が漏斗部に上がったら頃合いを見計らって火から下ろす.
 * 最近、アルコールランプやガスコンロ等を使用する直火式以外に電熱式も普及しつつある.
 * パーコレータ
 * コーヒー粉の入った籠状部分に湯を循環させ、抽出する. 機材の構造が単純であるため、メンテナンスは非常に容易でキャンプ等で用いられるが、美味しく抽出するのには熟練を要する.


 * トルココーヒー
 * ジェズヴェ（イブリック）という名の銅製または真鍮製の、柄杓のような形をした柄の深い小鍋に、深煎り細挽きの粉と水、砂糖を入れ直火にかける. かき混ぜながら煮沸し、煮立つ直前に火から離し落ち着いたら再度火にかける. これを2、3回繰り返し、表面の泡を消さないようにカップに注ぐ.
 * まず泡の味を楽しみ、粉の沈殿後に上澄みのみを飲用する. カップの底に粉が残ることから、この模様で運勢を占う「コーヒー占い」という習慣もある.
 * 概ね深煎りの豆を、ターキッシュミルという専用のミルで微粉末状にしたものを使用する. 砂糖以外にもカルダモンやクローブ、シナモン、コショウ等のスパイスを入れることもある.
 * ボイル
 * 単純な煮沸法. 粗挽きしたコーヒー粉と水を鍋・薬缶に入れて煮出し、上澄みだけを飲む. 岩塩を加えることもある. スウェーデンの伝統的なコーヒー休憩（フィーカ）など北欧やアフリカ 、ギリシャで見られる淹れ方. トルココーヒーに影響を受けたか、コーヒー専用の器材を持たない住民の淹れ方だと考えられる.


 * コーヒープレス
 * 粉と湯をプランジャーポットと呼ばれる器具（他にもティーサーバー、カフェティエール、ボナポット、フレンチプレス、メリオールなど様々な呼称がある）に一緒に入れて抽出する. プランジャーと呼ばれる軸の先端には金属やナイロン製のフィルタが付いており、このプランジャーを押し下げて抽出済みのコーヒーかすを沈め、上澄み部分をカップに移す. イギリスではコーヒーを淹れるのにペーパーフィルタ式よりもこのプランジャーが普及している. スティーピングに近いものとなっている.
 * コールドブリュー
 * コールドブリューは、冷水抽出、コールドプレスとも呼ばれ、挽いたコーヒーを低温の水に長期間浸す手法である. 粗挽きした豆を、約12〜24時間水に浸す . コールドブリューコーヒーは日本発祥であり、数世紀にもわたって伝統的なコーヒー醸造法として親しまれてきた .  スロードリップ式のコールドブリューは、京都式、または東アジアのダッチコーヒー（オランダ人がアジアに持ち込んだコーヒーエッセンスの名前に由来 ）とも呼ばれ、常温で何時間もかけてコーヒーの粉に水を滴下するプロセスである . コールドブリューに窒素を注入し、ニトロコールドブリューコーヒーを作ることもできる.
 * スティーピング
 * 単純な浸漬法. カップにコーヒーの粉と湯を加えてしばらく待ち、上澄みだけを飲む. コーヒーのテイスティングをする時にこの方法が用いられる.


 * 温度別
 * コーヒーは熱湯で抽出されることが多く、抽出されたそのままを、あるいは温め直されたものがホット・コーヒーとして飲まれる. 夏場などには、専用に濃く抽出したコーヒーを冷やしてアイス・コーヒーとして飲まれることも多い.
 * ブラックコーヒー
 * 抽出されたコーヒーに何も加えずそのまま飲むものをブラック・コーヒー 、あるいは単にブラックと呼ぶ. 多くの場合は、これに砂糖とクリームなどの乳製品を別に添えて出される. この場合、砂糖（グラニュー糖、白砂糖など）やクリームは飲む人が自分の好みに応じて加える.
 * 英語でblackとは日本と同様、何も加えないことを指すこともあれば、砂糖の有無については問わずに乳製品を加えないコーヒーを指すこともある.
 * バリエーション・コーヒー
 * また、上記した以外にも、牛乳やアルコール、香料などを加えて飲まれることがある. これらはバリエーション・コーヒー（アレンジ・コーヒー）と呼ばれる. エスプレッソやダッチ・コーヒーなど特殊な淹れ方をするコーヒーも、最も普及しているドリップ式のコーヒーと区別する目的でバリエーション・コーヒーに含めることが多い.


 * アイスコーヒー
 * カフェ・オ・レ
 * アイス・カフェ・オ・レ
 * エスプレッソ
 * カフェ・ラッテ
 * カプチーノ
 * ウィンナ・コーヒー
 * アイリッシュ・コーヒー
 * ダッチ・コーヒー
 * カフェ・ロワイヤル


 * アラビア・コーヒー
 * 浅煎りの豆を小鍋で煮出し、砂糖なしで飲む.
 * トルココーヒー
 * 細かく挽いた豆を（好みによって砂糖とともに）濃く煮出し、濾さずにカップに注いだものから上澄みだけを飲む.
 * ベトナムコーヒー
 * カップの底に練乳を入れた上にフレンチローストコーヒーを注いだもの. 豆は深煎りしたロブスタ種を用いる.


 * コロンビア式コーヒー
 * ティントとも呼ばれる、黒砂糖を加えた沸騰した湯を用い、火を落してから粉を加え、数分静置して粉が沈んだところで上澄みだけ飲む.
 * インディアンコーヒー
 * 南インドで好まれるインド風カフェ・オ・レ. インド製のコーヒー・フィルターを使う. 鍋にミルクを入れて温め、ミルクが沸騰直前に深煎で入れたコーヒーと、砂糖、塩少々を入れる. 2つのカップを行き来させて、泡立てて飲む.
 * アメリカン・コーヒー
 * 湯で薄めたコーヒーとの認識が一般的であるためにバリエーション・コーヒーと言い難いが、本来は浅煎り豆から薄めに抽出したコーヒーのこと. アメリカで一時期コーヒー豆の高騰により少ない量でもおいしく飲めるように浅煎りを用いていたことが起源.
 * グリーン・コーヒー
 * 焙煎する前の生豆の状態から成分を抽出したコーヒーで、加熱で壊れやすいクロロゲン酸が効率的に摂取できることから、2011年のインドMallya HospitalのM.V.Nagendranらによる研究結果以降、アメリカを中心にブームが起こる. 研究結果では血糖値減少効果、ダイエットと体脂肪の平均15.8%、BMI10.3%の大幅減少などが確認された. これに伴い生豆成分を手軽に飲めるように商品化もされており、植物抽出技術を持つスマカフェなどの会社による販売も行われている.
 * サルタナコーヒー
 * コーヒー豆ではなく、コーヒーの実を乾燥させたものを少し焙ってから煮出したもの. イエメンではギシルと呼ばれる.


 * コーヒーぜんざい
 * 小豆の餡を加えたコーヒー. 生クリームやアイスクリームを同時に添えることも多い. 餡コーヒー、あずきコーヒーとも.
 * 鴛鴦茶（コーヒー紅茶）
 * 香港式で、別途淹れた紅茶と混ぜて、砂糖、練乳を加え、ホットまたはアイスで飲む.
 * レモンコーヒー
 * レモンティーの様にレモンスライスを浮かべ、アイスまたはホットで飲む. イタリア南部や香港で見られる.
 * フラッペ
 * ギリシャで飲まれているアイスコーヒーの一種で、グラスの中にインスタント・コーヒーの粉と水、練乳を加え、シェイカーでかき混ぜてから、氷を入れて飲む. かき混ぜる段階で泡がグラスの半分以上になるのが特徴. また練乳が入る為、かなり甘い.
 * 塩コーヒー
 * 通常のコーヒーに少量の塩を加えたもの. コーヒーに塩味を付けるのではなく、苦みや酸味を抑えて口当たりをまろやかにするのが目的のため、塩の量はひとつまみ程度にとどめる. 塩コーヒーはコーヒー発祥の地として知られるエチオピアにおける伝統的なコーヒーの飲み方の一つである. エチオピアだけでなく、他にもコーヒーに塩を入れる風習のある国は多数ある.
 * 海軍風コーヒー
 * アメリカ海軍に伝わる塩コーヒーの一種. 通常の1.5倍量のレギュラーコーヒー粉に食塩少々を混ぜ、ドリップする.
 * ドラフトコーヒー
 * アイスコーヒーを生（ドラフト）ビール用サーバーに通して窒素を入れて注ぎ、泡立たせて飲む. 黒ビールのような見かけになる.

抽出の手間を掛けずに手軽にコーヒーを飲むためのものとして、インスタントコーヒー、缶コーヒー、リキッドコーヒーが工業的に生産されている.

日本における、缶コーヒー製品などの「コーヒー」表示は、「コーヒー飲料などの表示に関する公正競争規約」に基づく区分により、製品内容量100グラム中の生豆使用量によって、次の3種類に区分される.


 * コーヒー
 * 5グラム以上
 * コーヒー飲料
 * 2.5グラム以上5グラム未満
 * コーヒー入り清涼飲料
 * 1グラム以上2.5グラム未満

製品に乳固形分を3%以上を含むものは「乳及び乳製品の成分規格等に関する省令（乳等省令）」に基づき「乳飲料」となる（カフェ・オ・レ、カフェ・ラッテ、コーヒー牛乳など）.

お湯で溶かして飲むタイプのコーヒー. 公正競争規約上は中にコーヒー豆を含まず、コーヒー抽出液のみを原料とする製品に限られる（中にコーヒー豆を含むと「レギュラーコーヒー」扱いになる）. このため、2010年代に入り中にコーヒー豆を含む製品を含んだ総称として（特にネスレが他社との差別化のため、2013年9月出荷分から）「ソリュブルコーヒー」という呼称も使われるようになった. 「ソリュブル」とは“溶け易い”の意.

抽出・調味されたコーヒーを缶に充填したタイプのコーヒー. しばしば貯蔵中のコーヒーの劣化が問題となってきた.

ペットボトルや紙パックなどの容器に充填したタイプのコーヒー. ボトル入りのものはボトルコーヒーともいう. 日本のデスクワークなどの場においては、蓋を閉めなおして数回に分けて飲めるペットボトル入りの需要が増えている. コーヒーを一杯分ずつ小分けにしたものとしてポーションコーヒーがある.



代用コーヒーとは、コーヒー豆以外の原料を使って造られたコーヒーを模した飲料である.

代用コーヒーについての最古の記録はフリードリヒ2世統治下のプロイセンで見られる. コーヒー豆の輸入超過を抑制し、国内ビール産業の保護を目的とした1777年のビール・コーヒー条例によって、コーヒーに高い関税が掛けられることになった. その結果、庶民がコーヒーの代用品を飲む様になったと記されている. また、南北戦争中の米国や、第一次・第二次世界大戦の時にコーヒー豆の輸入が滞った地域（日本など）、冷戦時の東欧諸国でも代用コーヒーが飲まれた.

日本における代用コーヒーの登場は日中戦争が激化していた1939年頃であり、輸入量が減ったコーヒーを増量するために広まった. 日本では代用コーヒー（コーヒーに増量するためにコーヒー以外の原料を追加したもの）とイミテーションコーヒー（コーヒー以外の原料を主材料としてコーヒーに似せて作られたもの）を区別することがある.

代用コーヒーは、各種食用植物を煎って粉末にして、湯で抽出したものが主に飲まれた. 原料はタンポポの根、ゴボウ、ジャガイモ、サツマイモ、百合根、サクラの根、カボチャの種、ブドウの種、ピーナッツ、大豆、ドングリ、アーモンド、大麦、トウモロコシ、チコリ、玄米、根セロリ、パンの耳、綿やオクラの種子などが挙げられる.

代用コーヒーはあくまで代用品として考案されたものなので、コーヒーの安定供給が続いている地域・時代ではその消費量は少ない. しかし、代用コーヒーのほとんどはカフェインを含んでいないため、カフェインの摂取を避けている人がコーヒーの代わりに飲む場合がある. また大豆コーヒーなどは大豆の栄養価が評価され、健康食品として販売されている. 価格については、代用食品ではあるものの、本物のコーヒーよりもかなり高額な場合が多い.

コーヒー豆を容易に入手できる地域・時代であっても、コーヒー豆を使わない類似の飲料を楽しむ食文化も存在する. 例としては、大麦を原料とするカッフェ・ドルゾなどがある. 現代の日本でも、大豆コーヒーやスペイン風のコーヒー風大麦飲料 などが商品化されている.

2020年代からは、合成生物学によりコーヒーと同じ分子組成を持つ人工コーヒーの開発プロジェクトが進行している.

コーヒーノキを培養しコーヒーを製造するプロジェクトもある.

コーヒーには飲む以外に様々な用途がある.


 * コーヒーソース
 * – コーヒーソースの一種で色合いは薄め. 一から作る際にブラックコーヒーを使用することがあり、このソースは南部料理で用いられる.
 * 食品原料
 * コーヒー豆から抽出したエキスを香り付けや味付けのために用いたもの
 * ういろうなどの和菓子
 * ビスケット、パン、ケーキなどの焼き菓子
 * ガム、チョコレートなどの洋菓子
 * コーヒーゼリーなどのチルドデザート類
 * コーヒー牛乳などの清涼飲料・乳飲料
 * カルーア - コーヒー豆を使ったリキュール
 * その他
 * 染料
 * 脱臭剤 - コーヒー豆の出し殻を使う.
 * 成形木炭 - コーヒー豆の出し殻を木炭化し成形したもの. ハイカロ炭などの商品名で流通している.
 * コーヒー風呂 - 焙煎した豆を荒挽きにして酵素を用いて自然発熱させた砂風呂形式の風呂、または抽出した飲用コーヒーをそのまま用いる風呂. 家庭用にコーヒー粉末をティーバッグ状にして浴槽に入れる製品がある.
 * カタツムリ・ナメクジよけ - これらの種にはカフェイン成分が微量でも毒性として働く ため、コーヒーならびにコーヒー殻は有効である.
 * コーヒー浣腸 - コーヒーを成分とする溶液を肛門から注入、直腸洗浄する事で「肌が改善」などと謳う健康療法があるが医学的な根拠は無い.

この他、コーヒーの実自体をスープに入れたり、粥のようにしたりして食べるという行為が、10世紀頃には行われていたことがある. この方法でコーヒーを摂取しても眠気覚ましなどに効果があったと言われている.

コーヒーの世界市場規模は2018年の小売金額で880億ドルと推計されている（イギリスの調査会社ユーロモニターインターナショナルによる）. ネスレが24.9％のシェアを持つ最大手で、オランダのヤコブ・ダウ・エグバーツ（10.2％）などが続く.

2010年代半ば以降、新興国の所得向上や食生活の欧米化により世界のコーヒー豆消費量は右肩上がりである. 今後も増加傾向が続くと予想されている. 日本の丸紅（総合商社）の予測では、2021～2022年度は世界生産量1億6681万袋（60キログラム入り）を消費量（1億7849万袋）が上回る. コーヒー豆相場の下落期に中米などに多い手摘み農家がキャッサバ、果実、コカなどに転作した影響が出つつある. また気候変動（地球温暖化）で2050年頃にアラビカ種の生産地が半減する懸念がある「2050年問題」が指摘される一方で、現在は気温が低い高地などでコーヒー栽培が可能になる面もある.



北欧諸国はコーヒー消費量の多い国であり、フィンランドの消費量は世界最大で、10位のカナダの2倍に迫り、アメリカの3倍に迫る. 一人当たり年間消費用トップ10を以下に示す.


 * 1) フィンランド    – 12 kg
 * 2) ノルウェー     – 9.9 kg
 * 3) アイスランド    – 9 kg
 * 4) デンマーク    – 8.7 kg
 * 5) オランダ – 8.4 kg
 * 6) スウェーデン     – 8.2 kg
 * 7) スイス – 7.9 kg
 * 8) ベルギー    – 6.8 kg
 * 9) ルクセンブルク – 6.5 kg
 * 10) カナダ     – 6.5 kg

コーヒーの生豆には多糖を中心とする糖類、アミノ酸やタンパク質、脂質の他、コーヒーに含まれるポリフェノールであるクロロゲン酸、アルカロイドであるカフェイン（豆重量の1%程度）やトリゴネリン、ジテルペンであるカフェストールやカーウェオールなど、特徴的な成分が含まれている. コーヒーの脂質の75%は中性脂肪で結合している脂肪酸の種類は、リノール酸、パルミチン酸、ステアリン酸、オレイン酸などがその主成分で、他の植物との大きな違いはない.

これらの成分は焙煎されることによって化学変化を起こし、その結果数百種類にのぼる成分が焙煎豆に含まれる. 焙煎の初期にまず生豆中の水分が蒸発し、その後一連の焙焦反応と呼ばれる反応が起きる. 多糖やタンパク質はこの過程で加熱分解され、それぞれ低分子の糖類やアミノ酸を生じ、様々なコーヒーの味と香りを生み出す. クロロゲン酸がこれらの分子と共に加熱されることで褐色色素が生じ、コーヒーの色を生み出す. この他、糖類のみの加熱により生じるカラメルや、糖類とアミノ酸によるメイラード反応なども色素の生成に関与する. これらの色素はコーヒーメラノイジンと総称される. コーヒーの揮発性成分としては約900種類の化合物が同定されており、苦みを与える成分となるフェニルインダンは焙煎済のコーヒー内に含まれるその他のどの化合物よりも、アミロイドβとタウの脳への蓄積を阻害する働きを持つことが判明している.

中でもコーヒーの香りに大きな寄与をしている成分としては以下のものが知られている. 甘い蜜様の香りを持つβ-ダマセノン、コーヒーの特徴的な香りを持つ2-フリルメタンチオール、トロピカルフルーツ的な香りを持つギ酸3-メチル-3-スルファニルブチル、カラメル様の香気を持つフラネオール、ホモフラネオール、ソトロン、ホモソトロン、木クレオソート様の香りを持つグアイアコール、4-ビニルグアイアコール、4-エチルグアイアコール、醤油様の香りを持つ、ナッツ様のロースト香を持つ2-エチル-3,5-ジメチルピラジン、2,3-ジエチル-5-メチルピラジン、バニラ様の香りを持つバニリンなどである. ダマセノンはカロチノイドの分解により、グアイアコール類とバニリンはリグニンの分解により、カラメル様の香りの化合物は糖類の分解により、ピラジンなどその他の化合物は糖類とアミノ酸からメイラード反応で生じるとされている. これらの分子はすべて、苦味や酸味、甘味などのコーヒーの味を決定する上でも重要である.

最終的に飲み物であるコーヒーの抽出液には、これらのうち水溶性の比較的高い成分が溶出される. 抽出されたコーヒーは0.04%程度のカフェインを含むが、それ以外の多くの成分については詳細が不明なため研究が行われている.

これらの成分はコーヒーの複雑な味と香りを生み出すだけでなく、覚醒作用に代表されるようなコーヒーのさまざまな作用の原因にもなる.

コーヒーを摂取後、数分から数時間に出てくる代表的な作用として次のものが挙げられる. これらの急性作用は遅くとも一日以内には消失するものであり、健常時には特に健康上の問題を引き起こすことはないと考えられている. しかしながら過度に摂取した場合やそのときの体調によっては、一過性に問題を起こすことがある. また、特に消化器疾患、高血圧、パニック障害などの疾患がある場合など、特定の患者や病態によっては、これらの通常は無害な作用が有害に働くことがある.
 * 中枢神経興奮作用（精神の高揚・眠気防止/不安・不眠）
 * 骨格筋運動亢進作用（筋肉の疲労を取る/ふるえ）
 * 血圧上昇
 * 利尿作用
 * 胃液分泌促進（消化促進/胃炎を悪化させる）
 * 血中コレステロール（LDL, TC）増加
 * 大腸ぜん動運動の亢進（緩下作用/下痢）

健康な一般成人の場合、カフェインを1日当たり400mg以上を摂取しないようカナダ保健省は勧告している.

2021年6月24日に Nutritional Neuroscience によって発表された研究では、コーヒーを飲みすぎると（カフェインの有無にかかわらず）認知症のリスクが高まる可能性があることがわかった. ハーバード大学医学部では、1日あたり最大1.2リットルで停止することを推奨している. 1.4リットル以上飲むと脳に害を及ぼす可能性がある. 研究者たちは、コレステロールを増加させる可能性のあるカフェストールが原因である可能性があると指摘している.

コーヒーは発見当初から眠気防止や眠気覚まし、疲労回復などの作用を持つことに注目されてきた薬用植物、精神刺激薬である. 一方で、コーヒーが過度の刺激剤や興奮剤として働く可能性を指摘し、敬遠する人も存在している.

コーヒーには軽度の習慣性があるとされる. これはカフェインによる作用だと言われている. カフェインにはその苦みに対する感受性が高い人間に軽い依存症を引き起こす働きがあるという. ノースウェスタン大学の研究チームによれば、苦味成分の一種であるキニーネやプロピルチオウラシルに対する感受性が高い遺伝子を持つ人たちには、コーヒーの摂取量が少ない傾向がみられており、研究チームは「コーヒーを飲む人たちは、カフェインによって引き起こされる肯定的な影響（刺激）を学習し、カフェインを好む（検知できる）ようになったと考えられる」と説明している. そして研究チームはその習慣性が心理現象である可能性が含まれていることを指摘している. 加えて同大学の遺伝科学者チームは「カフェインに対する人の好みはその味によるものではなく、摂取後の感覚から生じている」可能性があるとしている.

また一日に300mg以上（コーヒー3杯に相当）のカフェインを常用する人には、カフェイン禁断頭痛と呼ばれる一種の禁断症状が現れることがある. これは最後のカフェイン摂取から24時間以上経過すると偏頭痛様の症状が現れるものである. このカフェイン禁断頭痛は症状が現れてから、カフェインを摂取することで30分以内に消失するが、カフェインを摂取しない場合は2日程度継続する. ただし、これらの症状は麻薬類やニコチン、アルコールと比較して、きわめて軽微なものだと考えられており、規制や年齢制限などは必要ないと考えられている.

コーヒーを長期間に亘って飲用した場合についても、多くの疫学的研究が古くから数多く行われてきた. 1980年までには「コーヒーが体に悪い」という視点からの報告が多かったが、それらの研究の多くは1990年代に、より精度を高めた追試によって否定されている. 一方、1990年代からは「コーヒーが体に良い」という視点からの研究もなされている.
 * 発症リスク低下（ほぼ確証）：パーキンソン病・大腸がん・直腸がん・2型糖尿病
 * リスク低下の報告あるが論争中 ：アルツハイマー病・肝細胞がん・胆石
 * リスク上昇の報告あったが後に否定された：高脂血症・膵臓がん・心不全・十二指腸潰瘍
 * リスク上昇の報告あるが論争中：関節リウマチ・高血圧・死産リスク・骨粗鬆症・膀胱がん
 * 発症リスク上昇（ほぼ確証）：（今のところ特になし）
 * コーヒーに含まれるクロロゲン酸にマルトースをグルコースに分解する酵素であるα-グルコシダーゼの阻害活性が認められ、ラットで食後の血糖上昇の抑制作用が認められた. カフェインにはα-グルコシダーゼ阻害活性は認められなかった . コーヒーをよく飲む人たちでは糖尿病発症のリスクが低くなる傾向が見られた.

2015年5月7日、日本の国立がん研究センターなどの研究チームがコーヒーおよび緑茶を日常的に摂取する人が、そうでない人に比較し病気などで死亡するリスクが大幅に低減するとする調査結果をまとめた. 調査は19年間にわたる追跡で日本全国の40-69歳の男女約9万人に対し行われ、他の生活習慣などと合わせ質問し、コーヒーおよび緑茶を1日にどれだけ摂取するか、というものであったが、その結果コーヒーを1日に3 - 4杯飲む者はほとんど飲まない者に対し、死亡リスクが24%低かった（緑茶=1日1杯未満の者に対し、1日5杯以上飲む男性で13%、女性で17%低減. 死亡リスクにかかわる年齢及び運動習慣などは影響を与えないよう統計学的に調整済み）. 19年間では約13,000人が死亡していた. 同チームは、調査結果の原因をコーヒーに含まれるポリフェノール、緑茶に含まれるカテキンによる血圧降下作用、両方に含有されるカフェインが血管や呼吸器の働きを高めている可能性を指摘した.

IARCは、従来コーヒー酸とコーヒー（膀胱癌のみ）を「グループ2B：発がん性があるかもしれないもの」、としていた が、2016年6月に発がん性を示す決定的な証拠はないとの発表を行った. またそれと同時に、65以上の熱い飲み物自体が食道癌の観点から「グループ2A：恐らく発がん性があるもの」に分類された. これにより「コーヒー（飲用）」は、「グループ3：発がん性を分類できない」に分類された. 評価文書は準備中である. コーヒー酸の評価は2Bのままである.

国立がんセンターがん予防・検診研究センター予防研究部（津金昌一郎、田島和雄ら）の調査により、肺ガン抑制効果が確認された. これは約10年間にわたる40 - 60歳代の男女約9万人に対する追跡調査で、計334人が肝細胞がんと診断され、コーヒーの摂取と肝細胞がんになるリスクの関係を統計的に分析した. 日常的にコーヒーを飲む人が肝臓がんになる率は10万人当たり約214人で、ほとんど飲まない人の場合は約547人. 1日に1〜2杯の人よりも、3〜4杯の人の方がリスクが減ったとされ、研究チームはコーヒーに含まれる抗酸化作用をもつ成分の影響かとしている. ただし、津金昌一郎研究部長は2008年、「いずれにせよまだ研究途上」と語っている.


 * 2009年、同研究部が実施したコーヒー摂取と肝がんとの関連に関する調査（対象者18815人、13年の追跡調査）では、 「コーヒーをほとんど飲まない」人が肝がんを発生する割合を1とした場合、「1日1杯未満」の集団では0.67、「1日1〜2杯飲む」集団は0.49、「1日3杯以上」は0.54となり、癌になる割合がおよそ半減するというデータが得られた. クロロゲン酸やカフェインなどの成分が肝機能酵素活性を改善したり、肝細胞炎症を軽減させたりしたのではないか、という考えが示されている.
 * 東京農工大学の研究グループは、試験管内の実験にてコーヒーに含まれるクロロゲンにガン細胞の転移を抑制する働きを発見した.
 * スウェーデンのカロリンスカ（Karolinska）研究所が、複数の研究成果のメタ解析で、毎日2杯のコーヒーの摂取により、肝がんの発症リスクを約4割減少させることを明らかにした. この予防効果は、肝臓関連の既往症がある場合でも同等であった.
 * 和歌山県立医科大学化学教室（当時）の岩橋秀夫教授らは実験により、コーヒーに含まれるクロロゲン酸がフリーラジカルの生成を阻害する仕組みを解明した. これはフリーラジカルの生成の阻害および、酸化の予防という二重の防御壁により、ガンを防ぐものと考えられている.
 * コーヒーは女性の浸潤結腸がんのリスクを低下させる.
 * 非喫煙者でコーヒー、カフェイン摂取量が高いほど膀胱癌のリスクが高くなるとの報告あり.

この他にも、経験的に言われている効用、さらには風説の類いまで含め、多くのコーヒーの作用が語られている. これらの中には、研究結果を誤解したもの、商用の宣伝目的と考えられるものなども含まれているため、他の健康ブームに乗った情報と同様、活用にあたっては注意が必要である.
 * 麻薬中毒者やタバコをやめたい人などが、コーヒーを飲用することにより禁断症状がやや緩和されるという.
 * 近年の研究では低血圧症、高血圧症の場合、血圧値を正常値に戻す働きがある事が指摘されている. また、善玉コレステロールを増やすなど心筋梗塞の予防にも役立つ他に、「酒皶（しゅさ）」と呼ばれる炎症性皮膚疾患の予防に有用な可能性がある とも指摘されている.
 * カナダ・トロントの研究所であるクレンビル・ブレイン・インスティテュート(Krembil Brain Institute)のドナルド・ウィーバー博士率いる研究チームによれば、アルツハイマー病患者の脳内に見られるアミロイドβの異常な塊の形成をコーヒーに含まれる化合物が抑制し、それによって神経を保護する効果がもたらされている可能性があるとしている.
 * 2007年にChoi Hyon K.らは コーヒーを飲む習慣が「痛風の発症リスクを低減する可能性を指摘していた. その後、コーヒーを飲む習慣が「痛風の発症リスク」を低減しているのは、尿酸値ではない何かが影響していると報道された.
 * コーヒーは「アルカリ性飲料」だとする主張. これは日本のコーヒーの業界団体である 全日本コーヒー協会 が昭和63年頃から行っていたキャンペーンの影響だと思われる. 当時はコーヒーは健康に悪いと考える風潮があり、それに対抗するために喫茶店経営者などに配布した「コーヒー&ヘルス」という小冊子にこの記述があった. コーヒーはアルカリ性ではなく酸性（pH 5 - 6）を示す（梅干しは酸性を示すがアルカリ性食品であると表現するのと同様の理由と思われる）.
 * 「酸化したコーヒーは体に悪い」という主張をする人がいる. コーヒー豆を保存するとき成分の酸化（特に脂質の酸敗）による品質低下が問題になること、抽出したコーヒーを保温しつづけると色素の酸化重合や過酸化水素などのフリーラジカルの生成がおきることが知られているが、健康との関係についての研究報告はまだ行われていない
 * 「酸化したコーヒーは体に悪い」という主張をする人がいる. コーヒー豆を保存するとき成分の酸化（特に脂質の酸敗）による品質低下が問題になること、抽出したコーヒーを保温しつづけると色素の酸化重合や過酸化水素などのフリーラジカルの生成がおきることが知られているが、健康との関係についての研究報告はまだ行われていない


 * コーヒーにはポリフェノールの一種であるクロロゲン酸類を始め、豊富な抗酸化物質が含まれており、肌の張りをよくし老化を防止する効果があるといわれている.
 * マウス、ラット実験では、コーヒーにはストレス緩和作用があると考えられる.


 * コーヒーカップ
 * コーヒーとドーナツ - アメリカではコーヒーとドーナツの組み合わせが一般的である.
 * コーヒー切手 - コーヒーをテーマにした切手.


 * 「良いコーヒーとは、悪魔のように黒く、地獄のように熱く、天使のように純粋で、愛のように甘い」 - フランスの政治家、タレーラン=ペリゴール
 * 「コーヒーは地獄のように黒く、死のように濃く、恋のように甘くなければならない」 - トルコの諺
 * 「数学者はコーヒーを定理に変える機械だ」 - ハンガリーの数学者、レーニ・アルフレード
 * 「私は自分の人生をコーヒースプーンで計り尽くした」 - 詩人、T・S・エリオット『J.アルフレッド・プルーフロックの恋歌』



コーヒーは歌曲の中で取り上げられることも多く、コーヒーそのものを題名に入れた曲も少なくない.
 * コーヒー・カンタータ（作曲：ヨハン・ゼバスティアン・バッハ BWV211 「そっと黙って、おしゃべりめさるな」 1732年）
 * J.S.バッハによる世俗カンタータの一つで、コーヒー・マニアの娘とコーヒー嫌いの父親との争いを歌うコミカルな作品. J.S.バッハ自身もコーヒー愛飲家であった.
 * 一杯のコーヒーから（歌：霧島昇+ミス・コロムビア、作詞：藤浦洸、作曲：服部良一 1939年）
 * 日本の懐メロの曲. 戦前から日本に喫茶店文化が根付いていたことを物語る曲でもある.
 * ブラック・コーヒー（Black coffee 作詞：ポール・フランシス・ウェブスター 作曲：ソニー・バーク 1948年）
 * コーヒーと煙草に浸る失恋の倦怠と絶望を歌ったブルージーなジャズ・スタンダード. 1949年にサラ・ヴォーンが初録音してヒットした. 日本では1954年デッカ録音のペギー・リー版が名唱として知られる.
 * コーヒールンバ（Moliendo Café（英語版） 作詞・作曲：Jose Manzo Perroni 1958年、日本語詞作詞：中沢清二）
 * ベネズエラのアルパ奏者ウーゴ・ブランコが録音し世界的にヒット（1961年）、日本でもエキゾチックさが好まれて何度もリバイバルしている. 曲のリズムは実際にはルンバではない. 歌：西田佐知子（1961年）、国実百合（1991年 國實唯理名義）、荻野目洋子（1992年）、井上陽水（2001年）、工藤静香（2002年）
 * コーヒーはいかが（ドイツ民謡、作詞：花岡恵）
 * 教育芸術社の音楽の教科書に掲載された.


 * ドキュメンタリー映画『おいしいコーヒーの真実』ではエチオピアのコーヒー農家の実情を描いている.


 * エチオピアにはコーヒー・セレモニー（カリオモン）と呼ばれる風習がある. 主催者が客に対してその場で焙煎・粉砕・抽出したコーヒーを振る舞い、みんなで回し飲みをするなど、日本の茶道と共通した部分も多い.
 * トルコやドイツでは、コーヒーを飲んだ後の残滓がカップの底に作る模様で運勢を占う、コーヒー占いを行うことがある.
 * 会議などの合間にとる5分から15分程度の小休止をコーヒーブレイクと呼ぶ. 会議の参加者らがコーヒーなどのソフトドリンクを飲みながら談笑することで気分転換を図る習慣から生まれた呼び名である.
 * 「一緒に夜明けのコーヒー（あるいはモーニングコーヒー）を飲む」という言葉は、男女が深い関係になることの暗喩として用いられることがある.
 * モルモン教ではコーヒーは禁止されている.
 * 朝鮮民主主義人民共和国では、コーヒーは資本主義社会の飲み物として排除されてきた. 一方、2020年のテレビ映像では、金正恩委員長のテーブルの上にアイスコーヒーらしき飲み物が置かれているなど変化の兆しも見られる.
 * 十六進数のC0FFEEはCOFFEE（コーヒー）に見えることから、プログラミングにおけるプレイスホルダとして使われることがある.
 * 高温のコーヒーにクリームを入れると、コーヒーに含まれる酸によってミルクの蛋白質が凝固し、かきたま汁のようになることがある. これをフェザーリング現象という.








 * 田口 護 『プロが教えるこだわりの珈琲』NHK出版 ISBN 4-14-187790-5
 * アントニー・ワイルド 『コーヒーの真実』 三角和代訳、白揚社、2009年. ISBN 978-4-8269-9041-7.
 * 旦部幸博 『コーヒーの科学』講談社ブルーバックス ISBN 978-4-06-257956-8


 * ホットコーヒー事件
 * コーヒーショップ
 * デカフェ
 * カフワ・アラビーヤ
 * - アメリカで販売されているコーヒーの銘柄. 直訳は「死の願望のコーヒー」. カフェイン含有量が通常のコーヒー豆の2倍であることから『世界最強のコーヒー』の異名を持つといわれている.
 * サッカーコロンビア代表 - 愛称は『	Los Cafeteros（コーヒーを作る男達）』
 * カフェ・ソスペーゾ
 * - コーヒーの品評.
 * - 18世紀ドイツでコーヒー焙煎税を取り立てていた職業.


 * 全日本コーヒー協会
 * International Coffee Organization
 * International Coffee Organization
`