export default `トロント（Toronto、標準音：、現地音：、漢字表記「多倫多」）は、カナダのオンタリオ州の州都であり、同国最大の都市. 北米屈指の世界都市であり金融センターである. オンタリオ湖岸の北西に位置し、2016年の統計で人口273万人.

2016年の都市圏人口は624万人. オンタリオ湖西岸を囲むゴールデン・ホースシュー（Golden Horseshoe）と呼ばれる都市化された地域の人口はおよそ924万人とされる.

またヒューロン語で「集まる場所」という意味がある. 1834年までの旧名はヨーク（Town of York）.

トロントはカナダ経済の商都であり、金融や経済、電気通信、航空宇宙、運輸、メディア、芸術、映画、テレビ局、出版、ソフトウェア、医療研究、教育、観光、スポーツなどの産業基盤が発達している. 国内企業の本社や多国籍企業が多く入っており、世界第6位の規模を持つトロント証券取引所（TSX）がある.

トロントには様々なスポーツのプロチームが本拠を構えており、トロント・メープルリーフス（NHL）やトロント・ブルージェイズ（MLB）、トロント・ラプターズ（NBA）、トロント・アルゴノーツ（CFL）、トロントFC（MLS）などがある.

超高層ビルが林立する大都会で、100mを超える超高層ビルが538棟と世界の都市で4番目に多い. かつて世界で最も高い建物であったCNタワーは、トロントの遠景を象徴する建築物になっている.

文化面でも国際的に重要な役割を果たしており、世界クラスの博物館や美術館、劇場、フェスティバルなどが多くある.

海外から移民と投資を多く受け入れていて急速に発展しているトロントは、多文化的かつ人口構成も国際色豊かである. 犯罪発生率は低く、街は清潔で、人々の生活水準も高い. また2019年には世界の主要大都市でトロントは6番目に安全だと評価されている.

また、トロントに住む人々は「トロントニアン（Torontonian）」と呼ばれる. ただし狭義ではトロントで生まれ育った人々のみを指す.

アメリカのシンクタンクが2017年に発表した総合的な世界都市ランキングにおいて、世界14位の都市と評価された. カナダの都市では首位である.



「トロント」の地名は、ヒューロン族の言葉で「人が集まる場所」を意味する言葉に由来するとされる説が一時有名であったが、本来、言語学的にはモホーク族の言葉で「水の中に木が立っている場所」を意味する「tkaronto」を由来とし、フランス人探検家や地図制作者を介してトロントになったとされる. 地勢的にはトロント北部のシムコー湖にヒューロン族が魚を囲い込むために苗木を植えたオリリア市の辺りを起源とする. 当時、オンタリオ湖からヒューロン湖の陸路輸送ルートであったこの辺りでは広く使われていた地名であった.

ヨーロッパからの入植が見られる以前からトロント周辺地域には紀元前1500年前にイロコワの部族から土地を占領した先住民ヒューロン族が定住していた.

1750年にフランス人商人によって交易所「フォート・ルイユ」（Fort Rouillé ）が設立されたが、1759年には使われなくなった. アメリカ独立戦争の際、英国王党派の流入が多く見られ、未入植の地であったオンタリオ湖岸の北部への入植が進んだ. 1787年、イギリスはオンタリオ湖北部の土地を所有するミシサガ族と交渉し、わずかな資金で購入することに成功した.

1793年、アッパーカナダ初代副総督であったジョン・グレイブス・シムコー（John Graves Simcoe）によってすでにあった入植地の上に町が設立され、ヨーク・オールバニ公の名から町名をヨークと名づけられた. そして、シムコーはアッパーカナダの首都をニューアーク（現在のナイアガラオンザレイク）よりアメリカからの攻撃にさらされにくいであろうと考えられたヨークに遷都することを決めた. 細長く延びる砂州によってできた天然港の入口に要塞である「フォートヨーク」が建設された. 町の入植は現在のパーラメント通りとフロント通りの近く、半島の背後にあたる港から東部の辺りに設立された.

1813年、米英戦争の最中、ヨークの戦いで町はアメリカ軍に占拠略奪された. 町の明け渡し交渉は、ジョン・ストラッチャン（John Strachan）によって行われたが、アメリカ軍の兵士は5日間の占領期間の間にヨーク砦を破壊し、国会議事堂に火を放った.

1834年3月6日、人口わずか9,000人であったがヨークの町は市制となり、名称を「トロント」へ改称した. 初代トロント市長は急進的改革派の政治家ウィリアム・ライアン・マッケンジー（William Lyon Mackenzie）が就任した. 彼は後の1837年に起きたアッパーカナダの反乱で、イギリス植民地政府であるアッパーカナダを相手に武装蜂起し、反乱軍を指揮したがあえなく敗退し、アメリカへ亡命することとなる. 以後19世紀の終わりにかけて、トロントはカナダの代表的な移民先となり、急速に発展を見せた. 最初の大きな人口流入は1846年から1849年に起きたアイルランドのジャガイモ飢饉によるもので、カトリック系のアイルランド人が多く移り住んだ.

1851年には、トロント市内でアイルランド生まれの人口が単独で最も大きな民族グループとなった. 数少ないプロテスタント系のアイルランド移民は、すでにいたスコットランド人とイギリス人に歓迎され、プロテスタント系の組合であるオレンジ結社はトロント社会に大きな影響力を持った.

トロントは1793年以来アッパーカナダの首都であった. また短い期間だが2回、最初の1849-1852年と2回目の1856-1858年の間、連合カナダの首都であった. 首都であったことから市内には王室の名代である副王が住む総督官邸があった. カナダの首都はその後ケベックを経て、カナダ自治領が誕生する1867年の前年に現在のオタワへ移った. トロントは1867年のオンタリオ州設立の際には州都と定められ、クイーンズパークに州議会議事堂が建設された.

19世紀中頃、トロントでは急速に産業化が進んだ. 大規模な下水処理施設が建設され、通りにはガス灯によって常時明かりが灯されるようになる. 長距離鉄道が建設され、五大湖北部とトロントを結ぶ路線が1854年に完成した. グランド・トランク鉄道とグレート・ノーザン鉄道は市街地にあった初代ユニオン駅の建物で結ばれた. 鉄道の出現で劇的な数の人口流入と商業の発展が見られ、同時にオンタリオ湖を航行する蒸気船とスクーナー船の入港も見られた. トロント鉄道会社が市政府より交通機関を運営する権利が与えられた1891年、輸送機関は馬車鉄道から電力で走る路面電車へと代わった. この会社は後に、北米の公共交通網としては3番目の規模をもつ現在のトロント交通局となる.



1904年のトロント大火で市街地の大部分は焼失したがすぐに再建された. この火災で1,000万カナダドル以上の被害を受け、この経験からより厳しく安全な消防法が採用され、消防署の設置を増やすに至った.

19世紀後半から20世紀初頭にかけて東ヨーロッパの広い地域からドイツ人やイタリア人、ユダヤ人を中心に新しい民族グループの移民が見られるようになった. この後、続いてすぐに中国人やロシア人、ポーランド人のほか、東ヨーロッパ諸国からの移民が目立った. そして、これらの新しい移民の多くは先のアイルランド人移民のように掘っ建て小屋のようなスラム街に密集して暮らすこととなる. スラム街となっていたいくつかの区域は、現在の金融街や先端医療の研究機関が集中するリサーチパーク（ディスカバリー地区）へと様変わりしている. 1920年代、急成長にもかかわらずカナダ国内におけるトロントの人口と経済力は、より歴史あるモントリオールに甘んじて2番目だった. それでも1934年には、トロント証券取引所が国内最大の証券取引所となる.

第二次世界大戦後、戦争で荒廃したヨーロッパからの難民が流入し、またイタリアとポルトガルからは出稼ぎの建設労働者が到来した. 1960年代後半に人種別移民受入政策が撤廃されて以来、世界中から移民がやって来るようになった. 1951年にトロントの人口は100万人を超え、以後大規模な郊外化現象とともに1971年には200万人を突破した. 1980年代にはトロントの人口はモントリオールを抜いてカナダ最大となり、カナダ経済最大の拠点となった. この時期、ケベック州で再び独立の動きが強まったことで政治不安が広がり、多くのカナダ企業と多国籍企業は本社をモントリオールからトロントやカナダ西部の都市へと移転させた.

トロント市は1954年に発足した地方自治体メトロポリタン・トロントの一都市として組み入れられた. 戦後のブームで郊外の急速な発展が進み、メトロ政府は土地利用と公共サービス提供の効率化のために、市町村の枠組みを超えて高速道路・公共交通機関・水道事業などのサービス提供を行った. 1967年、メトロポリタン・トロントはメトロ内の7つの小さな町や村をより大きい都市へと統合し、トロントとその周辺の都市、イーストヨークやエトビコ、ノースヨーク、スカボロ、ヨークの6つの都市で構成されるようになる. 1998年にメトロポリタン・トロントは解体され、この6つの都市を合併し、現在の新制トロント市が誕生した. 州の地方行政区では単一層自治体に位置づけられ、大きな行政権を持つ.

2003年に発生したSARSアウトブレイクでは、感染の中心地の一つとなり注目を集めた.

2009年3月には市制施行175周年を迎えた. 2010年6月にはG20サミットの開催地となり、カナダ各地域の警察官からなる統合治安部隊が組織され、サミット期間中のトロント中心部の警備を担った. 直前に開催されたG8サミットと併せたこの治安維持活動はカナダ史上最大の規模となり、1,000人を超える逮捕者数もカナダ史上最大となった.



トロントの面積は630.18 km2（243.21 sq mi）である. 南北の長さは最大21km、東西の長さは最大43kmある. 湖岸の全長は46km. 南はオンタリオ湖と、西はエトビコ・クリークとハイウェイ427号線と、北はスティールズ通り（Steeles Ave.）と、東はルージュ川と接し、それぞれが境界線となっている.

トロント湾を東西に挟みこむように、市西部を流れるハンバー川と市東部を流れるドン川の2つの川があり、加えて数多くの支流が街を縦断する. トロント湾は湖の水流からの土砂の堆積によって自然に形成され、同様にトロント島やレズリーストリートスピットが形成された. 小川と川が多いことから森林密度の高い峡谷が広がっており、公園や娯楽ハイキング用の小道を楽しむ理想的な場所になっている. しかしながら、峡谷は都市を格子状に設計することを阻んでおり、いくつかの通りは峡谷によって通りが分断され、またブロアー通りなどの大通りも陸橋で谷を跨ぐこととなった. これらの深い峡谷は集中豪雨の際、雨を排水する役割を果たしているが、ドン川の近くなど、いくつかの地点では大きな洪水になりやすい. しばしば川から大量の水が下水処理場の貯水タンクに流れ込み、処理しきれずにあふれ出すことがあり、汚水を未処理のままオンタリオ湖へ排出することがある.

最終氷期の時代、現在のトロントは氷河前縁湖であるイロコワ氷河湖（Glacial Lake Iroquois）に覆われていた. 今日、イロコワ湖岸（Iroquois Shoreline）で知られる氷河湖岸の跡を断層に見ることができる. これはスカボロの断崖（Scarborough Bluffs)を形成した断層でビクトリアパーク通り（Victoria Park Ave.）とハイランド・クリーク（Highland Creek）の河口の間に沿ってよく見ることができる. そのほか、セントクレア通り（St. Clair Ave.）に沿ってバサースト通り（Bathurst St.）とドン川の間にも見ることができる.

トロントは高低差があまりなく、オンタリオ湖岸の海抜75mに対し、市内の北端に位置するヨーク大学近くの海抜は270mである. トロント港にある現在の湖沿岸の土地は人工によってできた埋立地で、19世紀中頃の湖岸は今より1kmほど内陸にあった.

国内では南部に位置し、オンタリオ湖に接していることからトロントの気候はカナダの中では穏やかである. 湿度の高い大陸性の気候でケッペンの気候区分では亜寒帯湿潤気候（Dfa）に分類される. 夏は温暖で湿度があり、冬は一般的に寒い. ただし、夏は温暖と言えども日本では避暑地となり得る気候であり、冬はカナダ北部やアメリカ北西部の内陸と比べると温暖である.

四季がはっきりしているが、日々の気温に差があり、冬の寒い時期は特に気温差が大きくなる傾向にある. オンタリオ湖や他の五大湖の影響を受けやすく、湖に起因する降雪も見られる.

トロントの冬はときおり短期間ではあるが最高気温が −10℃(14) 以下に下がることがあり、冷えた風の影響で体感温度がさらに寒くなることがよくある. スノーストーム（吹雪）は時折、氷や雨が混ざって降ることもあり、雪の影響で仕事や旅行のスケジュールが大きく狂うこともある. 10月末から4月中旬までの期間であれば積雪の可能性がある. しかしながら、冬の期間に降り積もった雪が解けるほど気温が上がり、5〜14℃(40〜57) あるいはまれにこれ以上に暖かいこともある. また、特に冬季は市街地と郊外ではヒートアイランド現象により気温差が大きくなる.

夏のトロントは長期に渡って湿度が高いことを特徴とする. 時には日中の気温が 30℃(86) を超えることもあるが、通常は一過性のものであり、長くは続かない. そのため、蒸し暑く感じる日はあるものの基本的には快適な気候である. 春と秋は季節の移り変わりの時期で、一般に穏やかで涼しい気温になる. 天気は乾燥したり雨が降ったりを繰り返す. 同じ緯度にある内陸の地域と比べ、オンタリオ湖の影響を受けることから春や秋の訪れは遅く、気温は低めである.

降水量は年間を通じて分散しているが、通常、夏から秋にかけてが最も降水量の多い時期で、そのほとんどは集中豪雨として短時間のうちに降ることが多い. 年間降水量の平均は796.3mm.

トロントには傑出した設計の建物が数多くある. これらの多くは世界的な建築家による設計で、その代表的な例にはフランク・ゲーリーやダニエル・リベスキンド、ノーマン・フォスター、ウィル・アルソップ、イオ・ミン・ペイ、サンティアゴ・カラトラバ、ミース・ファン・デル・ローエの他、現地企業ではクワバラ・ペイン・マッケナ・ブラムバーグ建築事務所やダイアモンド・シュミット建築事務所どが含まれる.

トロントのスカイラインを象徴する最も代表的な建物はCNタワーであり、高さは553.33mである. 地上建築物としては一時期世界で最も高い建物であって、トロント観光の中核を成している. また、電波塔として重要な役割をも担っている.

BCEプレイスはトロントの市街地にある複合オフィスビルで、ベイ・ウェリントン・タワーとTDカナダ・トラスト・タワーの2つの高層ビルで構成され、6階建てのアレン・ランバート・ギャラリアとつながっている. ホッケーの殿堂もBCEプレイスにある. アレン・ランバート・ギャラリアはしばしば「商業のクリスタル大聖堂」（"crystal cathedral of commerce"）と表され、スペイン人建築家のサンティアゴ・カラトラバによってデザインされた. トロントの金融街で最も写真が撮られる場所のひとつで、テレビや映画撮影でも背景としてよく使われる.

コマースコートは4つのオフィスビル群で金融街のキング通りとベイ通りに位置する. 最初のビルは現在のコマースコート・ノースで、1930年にCIBCの本社として現在の敷地に先駆けて建設され、当時、カナダの中でも華麗な本社ビルのひとつとされた. ピアソン・ダーリング建設事務所の設計による34階建ての高層ビルで、1962年までは英連邦で最も高いビルであった. 1972年に残りの3つのビル、コマースコート・ウエスト（57階建て）、コマースコート・イースト（14階建て）、コマースコート・サウス（5階建て）が完成した. イオ・ミン・ペイの設計であるコマースコート・ウエストは1972-76年までカナダで最も高い高層ビル（239m）であった.

トロント・ドミニオン・センターはミース・ファン・デル・ローエによる設計で、トロント・ドミニオン・バンク・タワー（223m）を筆頭に、人目を引く黒い近代的な6つの高層ビルで構成された複合オフィスビルである.

オフィスやホテル、コンドミニアムを備えたトランプ・タワーが2012年に竣工. この超高層ビルは65階建てでアンテナの高さを含めると277mである. これは国内のオフィスビルとしてはファースト・カナディアン・プレイスに次ぐ高さに相当する（住宅、ホテルのビルとしては最も高い）. ファースト・カナディアン・プレイスは1976年に完成し、アンテナの高さを含めると355mある72階建ての超高層ビルである.

ダウンタウン以外にも多くの高層ビルが建てられており、ミッドタウントロント、ノースヨークのヤング・ストリートに沿ったノースヨーク・シティーセンター地区、エトビコのクィーンズウェイ・ハンバー・ベイ地区、スカーバローのスカーバロー・シティーセンター地区にもオフィスやコンドミニアムの高層ビルが集中している. その他、人口増加による住宅不足を補うようにトロント郊外各地にも高層コンドミニアムが建設中である.

市内にあるロイヤルオンタリオ博物館は、ダニエル・リベスキンドの手によって再設計され拡張工事が2007年6月に完成した. 通りに向かって5階建てのクリスタル風の外観が既存の建物を覆うような設計になっている. またオンタリオ美術館ではフランク・ゲーリーによる設計で内装、外観を含めて拡張工事が行われ、2008年11月に再公開された.

近年完成した建築物にウィル・アルソップの「テーブルトップ」とよばれるオンタリオ美術デザイン大学の建物がある. この大学はオンタリオ美術館の南側にあり、地上から40mの高さにある直方体の形をした2階建ての建物でカラフルな支柱によって支えられている.

2006年6月、フォーシーズンズ・センターが完成し、カナディアン・オペラ・カンパニーとカナダ国立バレエ団が本拠としている. ダイアモンド・シュミット建築事務所による設計で馬蹄形のヨーロッパ風の観客席になっている.

トロント大学でもビルの拡張や新築が行われており、ノーマン・フォスターやギュンター・ベーニッシュによって設計された校舎や宿舎がある. その他、トロント王立音楽院、カナダ国立バレエ学校などの建物なども古くからの建築と新規の建築部分を組み合わせた設計が多い.

住宅地の多くはトロントの商業地区に立ち並ぶ高層ビル群とは違う特徴を持っており、ビクトリア朝・エドワード朝時代の住宅街がローズデールやフォーレストヒル、キャベッジタウン、アネックス、ブライダルパス、ムーアパークなどに点在している.

ウィッチウッドパークにはトロント初期の頃にできた歴史的な建築物や住居が見られ、1985年にオンタリオ歴史遺産保護区に指定されている. 1911年に建てられたカサ・ロマは中世ヨーロッパの古城スタイルの建物で、エレベーターや秘密の通路、ボウリングのレーンなども備え付けられている豪邸であった. 邸宅や庭園があるスパダイナ博物館は19世紀に建てられたマナー・ハウスとして知られる.

トロント市は地勢的に大きく6つの地域で構成されており、もともとは独立した都市であった. 各都市ごとに発展してきた歴史をもつことから今でもそれぞれの地名が残り使われている. また、細かく区分すると100以上の地域に分かれる.
 * 合併前の6つの都市：イーストヨーク | エトビコ | ノースヨーク | オールド・トロント | スカボロ | ヨーク

旧トロント市は一般的にダウンタウンと呼ばれる地域を網羅し、トロントの歴史的な中心を成してきた. 今でも市内で最も高い人口密度をもつ. 金融街が広がるベイ通り沿いには、ファースト・カナディアン・プレイスやトロント・ドミニオン・センター、スコシア・プラザ、ロイヤル・バンク・プラザ、コマース・コート、BCEプレイスなどカナダで最も大きな超高層ビル群が立ち並ぶ. ダウンタウンの北部周辺には歴史豊かな住宅街も点在し、ヨークビルやローズデール、アネックス、フォーレストヒル、ローレンスパーク、ムーアパーク、カサロマなどの地区を指す. これらの多くは高級コンドミニアムや富裕層向けの住宅が広がる高級住宅街である. 同時にダウンタウン周辺には新しい移民や低所得層が高い比率で住んでおり、公共住宅や高層アパートなどがセントジェームズタウンやリージェントパーク、モスパーク、パークデールなどにある. ダウンタウンの東西に位置するケンジントンマーケットやレズリービル、キャベッジタウン、リバーデールなどのエリアには賑やかな商業地区と文化地区が広がっており、芸術家のスタジオなどや中産階級、富裕層に加えて、貧しい労働者や政府の生活保護を受けている貧困層が混在している. その他、市内にあるよく知られたエスニックタウンとして、2つのチャイナタウンやグリークタウン、リトルイタリー、ポルトガル・ビレッジ、リトル・ジャマイカ、リトル・インディアなどがある.

トロントの内輪には合併前まで都市であったヨークとイーストヨークが含まれ、伝統的に労働者階級が多く落ち着いたエリアになっている. また、クレセントタウンやソーンクリフパーク、ウエストンなどの地区には高層アパートがあり、新移民の家族が多く住んでいる. この地区の多くは民族構成が多様で近年、再開発が進んだことから、1990年代後半から人口の増加と住宅ブームが起きた. 最初にこの流れに乗ったのがリーサイドとノーストロントの地区で、段階的に西部へと再開発の波が訪れている. そして、いくつかの住宅街では今、建て替えまたは改装の過程にある.

トロントの外輪には同じく合併前まで都市であったエトビコやスカボロ、ノースヨークを含み、本格的な開発は戦後に行われた. 設立は早く、ミミコやニュートンブローク、ウエストヒルなどの地区では住宅ブームやメトロ政府が誕生する前、すでに急速な発展が見られた. 高級住宅街として知られるノースヨークのブライドルパス（Bridle Path）やスカボロの断崖周辺のギルドウッド（Guildwood）、エトビコの中心部、ハンバーバレービレッジ（Humber Valley Village）、キングスウェイ（The Kingsway）などもまた戦後、急速に成長した地区である. 郊外開発のモデルにもなったドンミルズ（Don Mills）は、都市計画に基づいて早くに開発された大きい住宅街のひとつで、タウンハウスや密度の高いアパート団地が建ち並ぶ. ヤング通り沿いのノースヨークセンターとスカボロのスカボロシティセンターはトロント・ダウンタウン中心部の外にある副都心として機能している. この地区に開発された高層の建築群がノースヨークとスカボロに独自の雰囲気をもたらしており、密度の高い交通網が発達している.

ディスティラリー地区はトロントでも特に個性的な地域のひとつで、ビクトリア朝の産業建築が数多くある. 北米では最も多くのコレクションをもち、保存状態も極めて良い. また、このエリアはトロント旧市街（Old Town Toronto）の一部を構成しており、観光名所のひとつとなっている. スカボロやエトビコには大きな工業団地が今もあるが、以前のような拡張や開発は行われていない.

ネイサン・フィリップス・スクエアはトロント市庁舎の南口にある市庁舎前広場で、再開発の計画が進んでいる.

オランダのランドスケープ設計事務所「ウエスト8」が2006年に行われたコンペティションで入選し、トロントの中心部を成すトロント・ウォーターフロントの新しいデザインが決まった.

ダウンズビュー公園は1999年の夏、カナダ初の国立都市公園構想を実現するべく、国際デザイン・コンテストに応募を募った. 2000年5月に入選作品が決まり、ブルース・マウ・デザイン、OMAらを含むチームが設計した「ツリーシティ」（TREE CITY）と呼ばれるデザインが選ばれた.

トロントには劇場や舞台芸術センターが多くあり、50以上のバレエとダンスの団体に加え、6つのオペラ団体と2つの交響楽団がある. カナダ国立バレエ団やカナディアン・オペラ・カンパニー、トロント交響楽団などが代表格. 公演の会場となる主な劇場にはフォーシーズンズセンターやロイトムソンホール、プリンセス・オブ・ウェールズ劇場、ロイヤル・アレキサンドラ劇場、マッセイホール、トロント舞台芸術センター、エルジン劇場、ウィンターガーデン劇場、ハミングバードセンターなどがある. オンタリオプレイスには世界で最初の常設IMAXシアターであるシネスフィアがあり、その他、屋外型の大規模なコンサート会場になるモルソン・アンフィシアターもある. ハイパークでは毎年夏に「"Dream in High Park"」と呼ばれる地元民に人気のイベントがあり、公園内にある円形劇場でシェークスピア劇がキャンステージによって上演されている. キング通りとシムコー通りの交差点沿いの歩道には星が埋め込まれたカナダ・ウォーク・オブ・フェイムがあり、大きな業績を上げたカナダ人を称えて作られたものである. ハリウッド・ウォーク・オブ・フェイムと比べ、いくつかの点において特徴に違いがある.

ディスティラリー地区は歩行者天国になっており、ブティック系のお店や美術館、レストラン、芸術家のスタジオのほか、小さな醸造所（ミルストリートが特によく知られる）が建ち並ぶ. 新しくできた舞台芸術劇場ヤングセンターはソウルペッパー劇団とジョージ・ブラウン・カレッジの演劇学科が本拠としている.

国内や海外の映画制作とテレビ制作は地元の大きな産業のひとつとなっており、トロントで撮影されたシーンが多くの映画で見ることができる. トロント国際映画祭は世界の映画産業界においても重要な年間行事のひとつとなっている. イギリスの映画製作会社パインウッド・スタジオがトロント西部に新しい複合型の映画スタジオを建設しており、2008年の秋に一部完成しオープンする予定.

カリバナは7月中旬から8月上旬に毎年行われる夏の行事で、北米でも規模の大きいストリート・フェスティバルのひとつ. トリニダード・カーニバルがベースになっており、最初のカリバナは1967年に開催された. その後、40年経ち、パレードにはトロントの湖岸に毎年100万人もの人々を惹きつけるほどに成長し、観光客も多く訪れる. そして、毎年このイベントではおよそ3億カナダドルもの経済効果をもたらしている.

トロントの最も有名な観光地はCNタワーで、1976年以来、世界で最も高い地上建築物として知られていたが、ワルシャワラジオ塔、ブルジュ・ハリーファなどに抜かれた.

ロイヤルオンタリオ博物館（ROM）は、世界各国の文化や自然史の作品を所蔵する代表的な博物館のひとつである. アートギャラリー・オブ・オンタリオ（AGO）はカナダ国内やヨーロッパ、アフリカ、現代美術など多くの収集品を所蔵する. ガーディナー博物館はカナダ唯一の陶磁器専門の博物館で、その所蔵品は2,900品以上を数え、アジアやアメリカ、ヨーロッパからのものを含む. バータ靴博物館もまた靴を展示する独特な博物館である.

オンタリオ・サイエンス・センターは主に子供向けのアクティビティや展示が多くある. ドンバレー・ブリック・ワークス（Don Valley Brick Works）は1889年に開かれた工業団地の跡で、近年、公園と歴史史跡として再興された. 毎年、夏になるとエキシビション・プレイスでカナディアン・ナショナル・エキシビション（CNE）が開催される. 歴史ある博覧会でカナダ最大、世界で5番目の規模をもち、およそ130万人が訪れる.

ヨークビルはトロントでも洗練された商業地区のひとつで、お洒落な店舗やレストランが建ち並ぶ. トロント国際映画祭の期間中など、様々な機会に北米の名士がよく訪れる場所でもある. トロント・イートン・センターは北米でトップレベルの集客を誇る観光客によく知られたショッピングセンターで、1週間で100万人以上もの人々が訪れる.

ダンフォースにあるグリークタウンもまた主な観光地として知られ、1km毎のレストランの密度は世界でも非常に濃い場所である. ヘンリー・ペラット卿（Henry Pellatt）の豪邸であったカサ・ロマはカナダで最もよく知られた城である. 他の有名な観光地にはザ・ビーチズ、トロント・アイランズ、ケンジントン・マーケット、フォート・ヨーク、ホッケーの殿堂などがある.

トロントの北40kmにあるカナダ・ワンダーランドはカナダ最大の遊園地で、年間362万人の来園者がある. 1981年に開園し、夏場 (5月～10月) のみ営業.

トロントはカナダ国内で最も大きなマスメディア市場をもち、北米ではニューヨーク、ロサンゼルス、シカゴに次いで4番目に大きい. 4つの日刊紙と2つの無料新聞紙があり、グレータートロントの市民に向けて発行されている. トロント市の地方紙トロント・スターとトロント・サン、全国紙のグローブ・アンド・メールとナショナル・ポストはいずれもトロントに本社を置く. カナダの主な英語放送のテレビ局はトロントに本社を置き、全国区の公共放送局であるCBCと最大の民放であるCTVほか、よく知られた主なテレビ局にシティTVやグローバルTVがある. また、代表的なスポーツ専門放送局ではザ・スポーツ・ネットワークやロジャース・スポーツネット、ザ・スコアがある. カナダの出版業界でも大部分がトロントに本社を置いており、雑誌マクリーンズ、シャトレイン、フレア、カナディアンリビング、カナディアンビジネス、トロントライフなどがその代表例である.

トロントはカナダでも6つのプロスポーツ（アイスホッケー、カナディアンフットボール、野球、バスケットボール、サッカー、ラグビーユニオン）のチームがある唯一の都市である. 市内の主要スポーツ施設としては、ロジャース・センター、エア・カナダ・センター、BMOフィールドなどがある. トロント・ウルフパックは大西洋横断的な初のプロラグビーリーグチームとして2016年に創設された.



トロントを本拠地とするプロスポーツチームは以下の通りである.

モータースポーツとしては、1986年から2007年の間、チャンプ・カーの「モルソン・インディ・トロント」をエキシビション・プレイスを中心とした市内コースで開催していた. 2009年から「ホンダ・インディ・トロント」としてインディカー・シリーズの一つとして再開した.

競馬としてはウッドバイン競馬場にて、サラブレッドによる平地競走とスタンダードブレッドによる繋駕速歩競走の両方が行われる. 国際競走も実施されている. プロテニスロジャーズ・カップも開催されている.

2009年3月に第2回WBC C組が開催された. 初のカナダ開催だった.

2015年には第17回パンアメリカン競技大会が開催された.



戦後のカナダ経済を牽引したアーガス・コーポレーションは世界金融危機で倒産した.

プライスウォーターハウスクーパースが公表した調査によると、トロントの2008年の都市GDPは、2530億ドルであり、世界第22位である. また、世界を代表する経済と金融センターのひとつで、カナダの金融機関が集中している. ベイ通りに銀行と証券会社が軒並み集中しており、トロントの金融街を成している. 時価総額で世界第8位の規模をもつトロント証券取引所があるほか、カナダの五大銀行すべてがトロントに本社を構える. 2017年3月の調査によると、世界10位の金融センターであり、カナダの都市では1位である.

マスメディアや出版、電気通信、情報工学、映画製作業界の重要な拠点で、トムソンコーポレーション、CTVグローバルメディア、ロジャース・コミュニケーションズ、アライアンス・アトランティス、セレスティカが本部を置く. そのほか代表的なカナダ企業にフォーシーズンズ・ホテル、フェアモントホテル、ハドソン湾会社（HBC）、マニュライフ・ファイナンシャルがある.

製造業の多くは市外に拠点を置くが、それでも卸売と流通産業においてトロントは重要な拠点となっている. ケベックとウィンザーを結ぶ道路と鉄道路線網は、沿道の自動車産業や製鉄、食品、機械、化学、製紙業の生産において重要な要素を担っており、1959年に完成したセントローレンス海路は五大湖と大西洋を船で航行することを可能にしている.

カナダ統計局による最新の国勢調査の統計によると2016年の人口は273万15711人で2011-2016年の人口増加率は4.5%であった. 国際連合開発計画によると、トロントは国外で生まれた移民の割合がマイアミに次いで世界で2番目に多い都市となっており、マイアミでは移民の出生地の多くはキューバや他の南米諸国であるのに対し、トロントは一つの国や文化が圧倒的な割合を占めることがなく多様性に富んでいる.

トロントの最も大きな民族グループはヨーロッパ系で全人口の約半数を占める. その内訳の多くはイギリス人、スコットランド人、アイルランド人、イタリア人、フランス人である. 人口の約半数は、白人以外であり、インド系、スリランカ系、パキスタン系などの南アジア系が68万人と最大勢力となっている. 中国系人口は48万人に達し、北米ではサンフランシスコ・ロサンゼルス・ニューヨーク・バンクーバーと並ぶ一大拠点となっている. カナダの都市の中では黒人も多く、特にジャマイカなどの西インド諸島出身者が多い. ベトナム系やフィリピン系などの東南アジア系も多く、その他、世界各地の移民で構成されている. 現在でも、毎年のようにアジアを中心に世界中から多くの移民を受け入れ、数年後には白人は少数派になると推測されている. この多様性が多くのエスニックタウンを生んでおり、リトル・イタリーやリトル・ジャマイカ、リトル・インディア、中華街、コリアタウン、グリークタウン、ポルトガル・ビレッジ、ポーリッシュタウン（東欧系）、ジューイッシュ・ネイバーフッズ（ユダヤ系）、ケンジントンマーケット（元々はユダヤ系移民の街だったが、近年は西インド系の店などが集まる）など多岐にわたる.

2007年現在、トロント在住の日本人は約1万人. 日系人全体を合わせると約3万人である. 日系企業も多く進出している.

トロントではキリスト教が最大の宗教で、2001年統計ではカトリック教会（31.1%）、プロテスタント（21.1%）、正教会（4.8%）、他のキリスト教宗派（3.9%）となっている. 他の宗教では、イスラム教（6.7%）、ヒンドゥー教（4.8%）、ユダヤ教（4.2%）、仏教（2.7%）、シク教（0.9%）、その他（0.2%）となっており、無宗教の立場の人々も18.7%いる.

トロントの人々の間では英語が圧倒的に優勢であるが、フランス語やイタリア語、広東語、スペイン語、ポルトガル語、タミル語、パンジャーブ語、ヒンディー語、ウルドゥー語などもかなり多く話されている. 職場で話される言語としてはイタリア語および広東語が2番目に多い言語とされる. その結果、救急サービスの911番では、150以上の言語に対応できるようになっている .



トロントは単一層自治体で議会は市長制を敷いている. 市の行政はトロント市の法令によって規定されており、市長は市の最高責任者として直接投票で選ばれる. トロント議会は一院制で構成されており、各地区を代表する44の市会議員によって成り立っている. 市長と市会議員の任期は4年で、再任に制限はない.

2006年度におけるトロントの年間予算は76億カナダドル. 歳入には税収入のほかオンタリオ州からの交付金が加えられ、予算の36%は州が策定し義務づけている行政計画に割り当てられている. 53%は市の主な行政サービスに割かれ、トロント交通局やトロント公共図書館、トロント動物園などの財源も予算に含まれる.

トロントには公立と私立の教育機関が多岐に渡ってあり、トロント教育委員会（Toronto District School Board）は451の公立小学校と102の中学と高校を運営している. これはカナダ国内で最も大きな規模を持つ教育委員会である. これにロマン・カトリック系の公立学校を運営するトロント・カトリック教育委員会（Toronto Catholic District School Board）がある. フランス語教育の公立学校を運営する教育委員会もあり、オンタリオ教育委員会（Conseil scolaire de district du Centre-Sud-Ouest）とオンタリオ・カトリック教育委員会（Conseil scolaire de district catholique Centre-Sud）がその役割を担っている. そのほか、多くの私立学校がある.

また、高等教育機関としてトロント内に設立されている州立大学は全部で4校あり、アルファベット順に並べると、オンタリオ美術デザイン大学、ライアソン大学、トロント大学およびヨーク大学がある.

これらの大学とは別に学位が取得できるコミュニティ・カレッジが5つあり、これはセネカ・カレッジ、ハンバー・カレッジ、センテニアル・カレッジ、シェリダン・カレッジ、ジョージ・ブラウン・カレッジが該当する. トロント王立音楽院のグレン・グールド学校は、代表的な音楽学校の一つで、カナディアン・フィルム・センターは映画、テレビ、メディアの専門学校で映画製作者であるノーマン・ジュイソンによって設立された.

トロント公共図書館は国内で最大規模の公共図書館システムを構成しており、99の図書館と1,100万冊以上の書籍所蔵数を持つ.



カナダ最大の空港であるトロント・ピアソン国際空港（IATA：YYZ、ICAO：CYYZ）が市内西部、ミシサガ市との境界にまたがった場所にある. 2つのターミナルがあり、24時間運営している.

また市街地近くに浮かぶトロント島にはビリー・ビショップ・トロント・シティー空港（通称：トロント・シティー空港またはトロント・アイランド空港、IATA：YTZ、ICAO：CYTZ）がある. ポーター航空のハブ空港であり、ボンバルディアDHC-8-400を使用しカナダ国内及びアメリカに運航している. 毎年9月に開催されるトロント航空祭に出演する航空機も多くこの空港を使用する（滑走距離の足りない機材はピアソン国際空港などを離着陸に使う）.

マークハムのバトンビル空港は定期便がほとんどないが一般的な航空設備を持つ. ダウンズビュー空港は市内北部にあり、ボンバルディア・エアロスペース社の航空機製造工場を兼ねている.

VIA鉄道、アムトラックおよびGOトランジットのユニオン駅はフロント・ストリート・ウェスト65にある.

VIA鉄道は下記の列車が発着する.
 * 夜行大陸横断列車のトロントとバンクーバーを結ぶカナディアン号が週3往復（春・夏ダイヤ）、週2往復（秋・冬ダイヤ）発着する.
 * 昼行中長距離列車のトロントとオタワ間への列車が1日8往復（平日）発着 、モントリオール間への列車が1日6.5往復（平日）発着  、ウィンザーへの列車が1日4往復（平日）発着  、サーニアへの列車が1日1往復（平日）発着 、季節運行のナイアガラ・フォールズへの列車が発着する.

アメリカへはアムトラックのトロントとニューヨーク間の昼行国際列車メープルリーフ号が1日1往復が発着している.

GOトランジットは下記の路線が発着している.
 * レイクショア・ウェスト線 … トロントとハミルトン間を運行
 * ミルトン線 … トロントとミルトン間を運行
 * キッチナー線 … トロントとキッチナー間を運行
 * バリー線 … トロントとバリー間を運行
 * リッチモンド・ヒル線 … トロントとリッチモンドヒル間を運行
 * ミルトン線 … トロントとミルトンを運行
 * スタウフビル線 … トロントと間を運行

その他の鉄道では、2015年開業のトロント・ピアソン国際空港とトロント・ユニオン駅を結ぶユニオンピアソンエクスプレスの列車と 、コクレーンへの の列車の発着駅でもある.



一般にTTCと呼ばれるトロント交通局は、地下鉄、市電（路面電車）、路線バスを運行する公共交通である. トロント市地下鉄はU字型をした南北を結ぶヤング・ユニバーシティ線と、東西を結ぶブロア・ダンフォース線、北部の東西を走るシェパード線がある. これに加えてスカボロRTラインが東部のスカボロを走っている. また、トロント市電は路面電車としては北米最大規模の広範囲な路線網を有している. 加えてバスが市内隅々まで運行されている. TTCは北米の公共交通網としてはニューヨーク市都市交通局とメキシコシティ・メトロに続いて第3位の規模を持つ.

オンタリオ州政府によって運営されているGOトランジットは7つの鉄道路線をもち、周辺の小都市を結んでいる. 鉄道のない地域には都市間輸送用の大型バスが主要な鉄道駅から発着しており、鉄道の枝線のような役割をしている. トロントを中心として半径140kmの範囲をカバーしており、毎日およそ16万人の利用客がある.

トロントとグレータートロント（GTA）を走る高速道路は数多くあり、400番台オンタリオ・ハイウェイのひとつ、ハイウェイ401号線（Highway 401）は市内中心部のバイパスとして東西を横断している. 北米で最も交通量の多い高速道路のひとつで、ハイウェイ401号線と400号線/ブラッククリーク・ドライブのインターチェンジでは最大22車線に広がり、毎日50万台以上の交通量がある.



トロントには少なくとも20以上の病院があり、トロント小児病院（SickKids）、マウント・サイナイ病院、セントマイケルズ病院、トロント総合病院、トロント・ウエスタン病院、サニーブルック・ヘルス・サイエンス・センター、プリンセス・マーガレット病院に加え、トロント大学医学部などがある.

トロントのディスカバリー地区 は医療研究のリサーチパークになっており、トロント・ダウンタウンの一角として溶け込んでいる. 2000年に、MaRSで知られる医療関連科学センターが作られ、州内の医療研究と開発の中心に位置づけられている. また、分子医学の研究機関ではマクラフリン・センター（MCMM）が知られる.

トロントは1996年、2008年の2度夏季オリンピック開催都市に立候補しているが、2度とも最終選考まで残りながら、僅差で落選した経緯がある. 2020年と2024年に再度立候補しようとしていた が、その後断念された.

トロントは以下の都市と「国際パートナー」関係を締結している.`